# 53. Напишите программу, которая выводит фразу «Я стану крутым программистом!» три раза на отдельных строках; строки должны быть именно такие, символ в символ!.

print('Я стану крутым программистом!\n' * 3)

# 54. Напишите программу, которая напечатает строку, состоящую из 777 букв "W"

print('W' * 777)

# 55. Напишите программу, которая выводит «Лев Николаевич Толстой написал "Война и мир"» (без внешних кавычек).

print('Лев Николаевич Толстой написал "Война и мир"')

# 56. Напишите программу, которая сначала считывает две фразы по очереди, а потом воспроизводит их в той же последовательности, каждую на отдельной строчке.

print(input(), input(), sep='\n')

# 57. Напишите программу, которая сначала считывает три фразы по очереди, а потом воспроизводит их в обратной последовательности, каждую на отдельной строчке.

print(*[input() for _ in range(3)][::-1], sep='\n')

# 58. Напишите программу, которая считывает с клавиатуры слово (или фразу, неважно), после чего выводит это же слово четыре раза на одной строке, разделяя их пробелами.

print(f'{input()} ' * 4)

# 59. Напишите программу, которая считывает с клавиатуры фразу и выводит на экран количество символов, которое содержалось в ней, учитывая все знаки препинания и пунктуации.

print(len(input()))

# 60. Напишите программу, которая считывает с клавиатуры два слова (или фразы, неважно), после чего вы должны при помощи операции конкатенации сцепить вторую фразу с первой и вывести результат на экран.

print((lambda a, b: b + a)(input(), input()))

# 61. Напишите программу, которая считывает с клавиатуры слово (или фразу, неважно), после чего вывести данную строку, увеличенную по длине  в 3 раза.

print(input() * 3)

# 62. Программа принимает на вход три символа через пробел в одну строку. Необходимо вывести код каждого символа при помощи функции ord в определенном формате.

[print(f'Simvol code {i} is {ord(i)}.') for i in input().split()]

# 63. Программа получает на вход строку и ваша задача вывести первый элемент данной строки

print(input()[0])

# 64. Программа получает на вход строку и ваша задача вывести последний символ этой строки

print(input()[-1])

# 65. Программа получает на вход строку и ваша задача вывести первые 4 символа этой строки. Гарантируется, что вводится будет строка длиной не менее 4 символов

print(input()[:4])

# 66. Программа получает на вход строку и ваша задача вывести последние 4 символа этой строки. Гарантируется, что вводится будет строка длиной не менее 4 символов

print(input()[-4:])

# 67. Программа получает на вход строку. Ваша задача вывести все символы этой строки, которые имеют четные индексы

print(input()[::2])

# 68. Программа получает на вход строку. Ваша задача вывести все символы этой строки, которые имеют нечетные индексы

print(input()[1::2])

# 69. Программа получает на вход строку. Ваша задача развернуть строку и вывести ее на экран.

print(input()[::-1])

# 70. Программа получает на вход строку. Выведите каждый третий символ строки в обратном порядке, начиная с последнего.

print(input()[::-3])

# 71. Программа получает на вход одно слово. Ваша задача перенести последнюю букву в начало, тем самым сдвинуть все остальные буквы вправо на один разряд. 
#     В качестве ответа нужно вывести полученное слово

print((s := input())[-1] + s[:-1])

# 72. 