# 777. Ваша задача выполнить сериализацию словаря из данного задания и сохранить полученную json-строку в переменную json_data. 
#      В качестве ответа ваша программа должна вывести на экран значение переменной json_data.

import json
d = {'a': 1, 'b': 2, 'c': 3, 'd': 4, 'e': 5, 'f': 6, 'g': 7, 'h': 8, 'i': 9, 'j': 10, 'k': 11, 'l': 12, 'm': 13, 
     'n': 14, 'o': 15, 'p': 16, 'q': 17, 'r': 18, 's': 19, 't': 20, 'u': 21, 'v': 22, 'w': 23, 'x': 24, 'y': 25, 'z': 26}
json_data = json.dumps(d)
print(json_data)

# 777. Перед вами имеется программа, которая десериализует JSON строку к питоновскому значению.
#      Сама JSON строка оформлена неправильно, поэтому в программе возникает ошибка json.decoder.JSONDecodeError.
#      Ваша задача найти и исправить ошибки в оформлении  JSON строки. Остальную часть программы не нужно менять.

import json


json_string = '''
{
    "customers": [
        {
            "userid": 123456,
            "username": "Allie Hsu",
            "phone": [
                "000-001-0002",
                "000-002-0002"
            ],
            "is_vip": true
        },
        {
            "userid": 223678,
            "username": "Donald Duck",
            "phone": null,
            "is_vip": false
        }
    ]
}
'''

data = json.loads(json_string)
print(data['customers'][0]['username'])