# 145. На вход программе поступает одно слово. Если это строка «Python», программа выводит ДА, в противном случае программа выводит НЕТ

print('ДА' if input() == 'Python' else 'НЕТ')

# 146. Во всех странах присутствует подоходный налог. В каких-то странах он больше, в каких-то меньше. В РФ граждане платят подоходный налог в размере 13%.
#      Представьте теперь, что люди с доходом меньше 20000 рублей освобождены от уплаты налога. 
#      Напишите программу, которая получает на вход значение дохода и выводит на экран сумму, оставшуюся после уплаты налога в 13%. Если у человека зарплата меньше 20000р налог не удерживается.

print(x if (x := int(input())) < 20000 else (x := x - x * 0.13))

# 147. Вводятся два целых числа, каждое в отдельной строке. Ваша задача вывести наибольшее из данных чисел. Примечание: используйте только условный оператор, функцией max пользоваться нельзя

print(x if (x := int(input())) > (y := int(input())) else y)

# 148. Программа получает на вход три натуральных числа A, B и C через пробел. Вам необходимо вывести YES в том случае, если A + B = C и вывести NO в противном случае.

((lambda a, b, c: print('YES' if a + b == c else 'NO'))(*map(int, input().split())))

# 149. Программа получает на вход список из целых чисел, при этом гарантируется, что числа в списке повторяться не будут. ​​Ваша задача удалить из этого списка числа 3, 5, 7 и 9. 
#      Обратите внимание, что каждое из чисел 3, 5, 7 и 9. необязательно должно присутствовать в введенном списке. В качестве ответа необходимо распечатать измененный список

l = list(map(int, input().split()))
[l.remove(i) for i in [3, 5, 7, 9] if i in l]
print(l)

# 150. На момент написания текста из РФ можно было вывозить не более 10000$ или эквивалент в другой валюте. При превышении этой суммы необходимо составлять декларацию.
#      Давайте представим, что сумму выше 10000 долларов таможня забирает себе и вам останется только 10000$.
#      Давайте напишем такую программу, которая будет принимать целое положительное число - сумма в долларах. 
#      Если она не превышает 10000$, то выводим текст Сумма <значение> не превышает лимит, проходите. 
#      Если сумма превышает 10000$ выводим текст Ого! <значение>! Куда вам столько? Мы заберем <разница>
#      И конечно же нужно использовать сами знаете кого, иначе ваше решение не пройдет

print(f'Сумма {x} не превышает лимит, проходите' if (x := int(input())) <= 10000 else f'Ого! {x}! Куда вам столько? Мы заберем {x - 10000}')

# 151. На вход вашей программе поступает фраза, если в ней присутствует слово walrus выводим текст Нашли моржа, иначе выводим Никаких моржей тут нет.

print('Нашли моржа' if 'walrus' in (s := input()) else 'Никаких моржей тут нет')

# 152. Программа принимает на вход два слова s и t. Если слово t является словом s, записанным наоборот, выведите YES, иначе выведите NO.
#      Слова состоят из маленьких латинских букв. Входные данные не содержат лишних пробелов. Слова непустые, и их длины не превосходят 100 символов.

print(('NO', 'YES')[input() == input()[::-1]])

# 153. Требуется написать программу, определяющую, является ли четырехзначное натуральное число N палиндромом, т.е. числом, которое одинаково читается слева направо и справа налево.
#      Программа получает на вход целое положительное четырехзначное число N  и должна вывести YES,  если число N является палиндромом, и NO - если не палиндром.

print('YES' if (x := input()) == x[::-1] else 'NO')

# 154. Даны три натуральных числа a, b, c записанные в отдельных строках. Ваша задача определить, существует ли треугольник с такими сторонами.
#      Для этого вспоминаем теорему о существовании треугольника. Она утверждает, что треугольник существует, если сумма любых двух сторон больше оставшейся третьей.
#      Выведите строку YES, если условие теоремы выполняется, иначе выведите строку NO.

a, b, c = sorted([int(input()) for _ in range(3)])
print('YES' if a + b > c else 'NO')

# 155. Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и получали билет с номером. 
#      Счастливым билетом называют такой билет с шестизначным номером (иногда и с незначащими нулями), где сумма первых трех цифр равна сумме последних трех. 
#      Т.е. билеты с номерами 385916 и 2011 – счастливые, т.к. 3+8+5=9+1+6 и 0+0+2=0+1+1. Вам требуется написать программу, которая проверяет «счастливость» билета.
#      Программа получает на вход одно целое число N (0 ≤ N < 106) и должна вывести «YES», если билет с номером N счастливый и «NO» в противном случае.

print('YES' if sum((x := list(map(int, f'{int(input()):06d}')))[:3]) == sum(x[3:]) else 'NO')

# 156. Напишите программу, которая на вход получает координаты двух клеток шахматной доски и выводит сообщение о том, являются ли эти клетки одного цвета. 
#      Столбцы на шахматной доске обозначаются английскими строчными буквами.
#      Программа должна выводить YES, когда клетки одного цвета, NO - разного. Гарантируется, что значение колонок это латинские буквы abcdefgh, а строки это символы цифр от 1-8

print('YES' if (ord((x := input())[0]) + int(x[1])) % 2 == (ord((y := input())[0]) + int(y[1])) % 2 else 'NO')

# 157. На вход программе поступает целое число. Ваша задача сохранить в переменную text  строку Even, если введенное число четное, иначе сохраните строку Odd
#      В качестве ответа необходимо вывести переменную text

print((text := 'Odd') if int(input()) % 2 else (text := 'Even'))

# 158. На вход вашей программе поступает два неравных друг другу целых числа в отдельных строках.
#      Ваша задача сохранить наименьшее из этих чисел в переменную  minimum, а наибольшее - в maximum. Использовать нужно, конечно же, тернарный оператор
#      В качестве ответа выведите через пробел сперва minimum , а потом maximum

print(*(minimum, maximum) if (minimum := int(input())) < (maximum := int(input())) else (maximum, minimum))