# 90. На летних каникулах Тимур и ученики онлайн-школы BEEGEEK решили отдохнуть. В результате n учеников школы поехали отдыхать на море, 
#     m учеников съездили в деревню, а k учеников сходили в горы. Оказалось, что и в деревне, и на море были x учеников, а в деревне и в горах — y учеников. 
#     Побывать и в горах, и на море не удалось никому. Напишите программу для определения количества учеников в школе, если никто не смог посетить все три места сразу, а 
#     z учеников писали ДВИ по математике для поступления в МГУ, и никуда не ездили.
# 
#     Формат входных данных
#     На вход программе подаются числа n,m,k,x,y,z, каждое на отдельной строке.
# 
#     Формат выходных данных
#     Программа должна вывести одно число в соответствии с условием задачи.
# 
#     Примечание. n – все ученики, которые поехали на море, m – все ученики, которые съездили в деревню, и k – все ученики, которые сходили в горы.

n, m, k, x, y, z = [int(input()) for _ in range(6)]
print(n + m - x + k - y + z)

# 91. Ученики 10 класса онлайн-школы BEEGEEK получили задание прочесть на летних каникулах три книги:
#     - "Что такое математика?";
#     - "Математическая составляющая";
#     - "100 гениальных идей по математике".
#     Оказалось, что n учеников прочитали первую книгу, m учеников — вторую, k учеников — третью. 
#     Также известно, что x учеников прочли первую или вторую, или обе эти книги, y учеников — вторую или третью, или обе, z учеников — первую и третью, 
#     или хотя бы одну из этих двух книг. Полностью выполнили задание только t учеников. Всего в 10 классе учится a учеников. 
#     Напишите программу, которая выводит сколько учеников:
#     - прочитали только одну книгу;
#     - прочитали две книги;
#     - не прочитали ни одной из рекомендованных книг.
# 
#     Формат входных данных
#     На вход программе подаются числа n,m,k,x,y,z,t,a, каждое на отдельной строке.
# 
#     Формат выходных данных
#     Программа должна вывести три числа в соответствии с условием задачи, каждое на отдельной строке.

n, m, k, x, y, z, t, a = (int(input()) for i in range(8))
r1 = n + m - x - t
r2 = m + k - y - t
r3 = k + n - z - t
r = (n - r1 - r3 - t) + (m - r1 - r2 - t) + (k - r2 - r3 - t)
print(r, r1 + r2 + r3, a - r - r1 - r2 - r3 -t, sep='\n')