# 90. На летних каникулах Тимур и ученики онлайн-школы BEEGEEK решили отдохнуть. В результате n учеников школы поехали отдыхать на море, 
#     m учеников съездили в деревню, а k учеников сходили в горы. Оказалось, что и в деревне, и на море были x учеников, а в деревне и в горах — y учеников. 
#     Побывать и в горах, и на море не удалось никому. Напишите программу для определения количества учеников в школе, если никто не смог посетить все три места сразу, а 
#     z учеников писали ДВИ по математике для поступления в МГУ, и никуда не ездили.
# 
#     Формат входных данных
#     На вход программе подаются числа n,m,k,x,y,z, каждое на отдельной строке.
# 
#     Формат выходных данных
#     Программа должна вывести одно число в соответствии с условием задачи.
# 
#     Примечание. n – все ученики, которые поехали на море, m – все ученики, которые съездили в деревню, и k – все ученики, которые сходили в горы.

n, m, k, x, y, z = [int(input()) for _ in range(6)]
print(n + m - x + k - y + z)

# 91. Ученики 10 класса онлайн-школы BEEGEEK получили задание прочесть на летних каникулах три книги:
#     - "Что такое математика?";
#     - "Математическая составляющая";
#     - "100 гениальных идей по математике".
#     Оказалось, что n учеников прочитали первую книгу, m учеников — вторую, k учеников — третью. 
#     Также известно, что x учеников прочли первую или вторую, или обе эти книги, y учеников — вторую или третью, или обе, z учеников — первую и третью, 
#     или хотя бы одну из этих двух книг. Полностью выполнили задание только t учеников. Всего в 10 классе учится a учеников. 
#     Напишите программу, которая выводит сколько учеников:
#     - прочитали только одну книгу;
#     - прочитали две книги;
#     - не прочитали ни одной из рекомендованных книг.
# 
#     Формат входных данных
#     На вход программе подаются числа n,m,k,x,y,z,t,a, каждое на отдельной строке.
# 
#     Формат выходных данных
#     Программа должна вывести три числа в соответствии с условием задачи, каждое на отдельной строке.

n, m, k, x, y, z, t, a = (int(input()) for i in range(8))
r1 = n + m - x - t
r2 = m + k - y - t
r3 = k + n - z - t
r = (n - r1 - r3 - t) + (m - r1 - r2 - t) + (k - r2 - r3 - t)
print(r, r1 + r2 + r3, a - r - r1 - r2 - r3 -t, sep='\n')

# 92. Дополните приведенный код так, чтобы он вывел сумму минимального и максимального элементов множества numbers.

numbers = {1.414, 12.5, 3.1415, 2.718, 9.8, 1.414, 1.1618, 1.324, 2.718, 1.324}
print(min(numbers) + max(numbers))

# 93. Дополните приведенный код, чтобы он вывел среднее арифметическое элементов множества numbers.

numbers = {20, 6, 8, 18, 18, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 12, 8, 8, 10, 4, 2, 2, 2, 16, 20}
average = sum(numbers) / len(numbers)
print(average)

# 94. Дополните приведенный код, чтобы он вывел сумму квадратов элементов множества numbers.

numbers = {9089, -67, -32, 1, 78, 23, -65, 99, 9089, 34, -32, 0, -67, 1, 11, 111, 111, 1, 23}
print(sum({i ** 2 for i in numbers}))

# 95. Дополните приведенный код, чтобы он вывел элементы множества fruits, каждый на отдельной строке, отсортированные по убыванию (в обратном лексикографическом порядке).
#     Примечание. Выводите каждый элемент множества на отдельной строке.

fruits = {'apple', 'banana', 'cherry', 'avocado', 'pineapple', 'apricot', 'banana', 'avocado', 'grapefruit'}
print(*sorted({i for i in fruits}, reverse=True), sep='\n')

# 96. На вход программе подается строка текста. Напишите программу, которая определяет количество различных символов в строке.
# 
#     Формат входных данных
#     На вход программе подается строка текста.
# 
#     Формат выходных данных
#     Программа должна вывести количество различных символов в строке.
# 
#     Примечание. Задачу можно решить в одну строчку кода.

print(len(set(input())))

# 97. На вход программе подается строка, состоящая из цифр. Необходимо определить, верно ли, что в ее записи ни одна из цифр не повторяется?
# 
#     Формат входных данных
#     На вход программе подается строка, состоящая из цифр
# 
#     Формат выходных данных
#     Программа должна вывести YES если ни одна из цифр в строке не повторяется и NO в противном случае.

print('YES') if len(s := input()) == len(set(s)) else print('NO')

# 98. На вход программе подаются две строки, состоящие из цифр. Необходимо определить, верно ли, что в записи этих двух строк используются все десять цифр?
# 
#     Формат входных данных
#     На вход подаются две строки, состоящие из цифр.
# 
#     Формат выходных данных
#     Программа должна вывести YES, если в записи этих двух строк используются все десять цифр, и NO в противном случае.

s1, s2 = list(map(int, set(input()))), list(map(int, set(input())))
flag = True

for i in [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]:
    if i not in s1 and i not in s2:
        flag = False
        
print('YES') if flag else print('NO') 

# 99. На вход программе подаются две строки, состоящие из цифр. Необходимо определить, верно ли, что для записи этих строк были использованы одинаковые наборы цифр?
# 
#     Формат входных данных
#     На вход подаются две строки, состоящие из цифр.
# 
#     Формат выходных данных
#     Программа должна вывести YES, если для записи этих строк были использованы одинаковые наборы цифр и NO, в противном случае.

print('YES' if set(input()) == set(input()) else 'NO')

# 100. На вход программе подается строка, состоящая из трех слов. Верно ли, что для записи всех трех слов был использован один и тот же набор букв?
# 
#      Формат входных данных
#      На вход программе подается строка, состоящая из трех слов.
# 
#      Формат выходных данных
#      Программа должна вывести YES, если для записи всех трех слов был использован один и тот же набор букв и NO в противном случае.

s = input().split()
print('YES' if set(s[0]) == set(s[1]) == set(s[2]) else 'NO')

# 101. Напишите программу для вывода количества уникальных символов каждого считанного слова без учета регистра.
# 
#      Формат входных данных
#      На вход программе в первой строке подается число n – общее количество слов. Далее идут n строк с словами.
# 
#      Формат выходных данных
#      Программа должна вывести на отдельной строке количество уникальных символов для каждого слова.

print(*[len(set(input().lower())) for _ in range(int(input()))], sep='\n')

# 102. Напишите программу для вывода общего количества уникальных символов во всех считанных словах без учета регистра.
# 
#      Формат входных данных
#      На вход программе в первой строке подается число n – общее количество слов. Далее идут n строк со словами.
# 
#      Формат выходных данных
#      Программа должна вывести одно число – общее количество уникальных символов во всех словах без учета регистра.

tmp = [input().lower() for i in range(int(input()))]
x = []
for i in range(len(tmp)-1):
    x += tmp[i] + tmp[i+1]
print(len(set(x)))

# 103. Напишите программу для определения общего количества различных слов в строке текста.
# 
#      Формат входных данных
#      На вход программе подается строка текста.
# 
#      Формат выходных данных
#      Программа должна вывести одно число – общее количество различных слов в строке без учета регистра.
# 
#      Примечание 1. Словом считается последовательность непробельных символов, идущих подряд, слова разделены одним или большим числом пробелов.
#      Примечание 2. Знаками препинания .,;:-?! пренебрегаем.

print(len(set(__import__('re').sub(r'[.,;:-?-!]', '', input().lower()).split())))

# 104. На вход программе подается строка текста, содержащая числа. Для каждого числа выведите слово YES (в отдельной строке), 
#      если это число ранее встречалось в последовательности или NO, если не встречалось.
# 
#      Формат входных данных
#      На вход программе подается строка текста, содержащая числа, разделенные символом пробела.
# 
#      Формат выходных данных
#      Программа должна вывести текст в соответствии с условием задачи.
# 
#      Примечание. Ведущие нули в числах должны игнорироваться.

numbers = list(map(int, input().split()))
s = set()

for i in numbers:
    if i not in s:
        s.add(i)
        print('NO')
    else:
        print('YES')

# 105. На вход программе подаются две строки текста, содержащие числа. 
#      Напишите программу, которая определяет количество чисел, которые есть как в первой строке, так и во второй.
# 
#      Формат входных данных
#      На вход программе подаются две строки текста, содержащие числа, отделенные символом пробела.
# 
#      Формат выходных данных
#      Программа должна вывести количество чисел, содержащихся одновременно как в первой строке, так и во второй.

print(len(set(input().split()) & set(input().split())))

# 106. На вход программе подаются две строки текста, содержащие числа. 
#      Напишите программу, которая выводит все числа в порядке возрастания, которые есть как в первой строке, так и во второй.
# 
#      Формат входных данных
#      На вход программе подаются две строки текста, содержащие числа, отделенные символом пробела.
# 
#      Формат выходных данных
#      Программа должна вывести на одной строке через пробел числа, встречающиеся в обеих строках.

print(*sorted(set(map(int, input().split())) & set(map(int, input().split()))), sep=' ')

# 107. На вход программе подаются две строки текста, содержащие числа. 
#      Напишите программу, которая выводит все числа в порядке возрастания, которые есть в первой строке, но отсутствуют во второй.
# 
#      Формат входных данных
#      На вход программе подаются две строки текста, содержащие числа, отделенные символом пробела.
# 
#      Формат выходных данных
#      Программа должна вывести множество чисел, встречающихся только в первой строке.

print(*sorted(set(map(int, input().split())) - set(map(int, input().split()))))

# 108. На вход программе подается натуральное число n, а затем n различных натуральных чисел, каждое на отдельной строке. 
#      Напишите программу, которая выводит все общие цифры в порядке возрастания у всех введенных чисел.
# 
#      Формат входных данных
#      На вход программе подаются натуральное число n≥1, а затем n различных натуральных чисел, каждое на отдельной строке.
# 
#      Формат выходных данных
#      Программа должна вывести цифры в соответствии с условием задачи. Если общих цифр нет, то ничего выводить не нужно.

lst = [set(input()) for _ in range(int(input()))]
print(*sorted(set.intersection(*lst)), sep=' ')