# 21. Дополните приведенный код, используя списочный метод append(), чтобы список list1 имел вид:
#     list1 = [10, 20, [300, 400, [5000, 6000, 7000], 500], 30, 40]

list1 = [10, 20, [300, 400, [5000, 6000], 500], 30, 40]
list1[2][2].append(7000)
print(list1)

# 22. Дополните приведенный код, используя списочный метод extend(), чтобы список list1 имел вид:
#     list1 = ['a', 'b', ['c', ['d', 'e', ['f', 'g', 'h', 'i', 'j'], 'k'], 'l'], 'm', 'n']
#     Подсписок для расширения  sub_list = ['h', 'i', 'j'].

list1 = ['a', 'b', ['c', ['d', 'e', ['f', 'g'], 'k'], 'l'], 'm', 'n']
sub_list = ['h', 'i', 'j']
list1[2][1][2].extend(['h', 'i', 'j'])
print(list1)

# 23. Дополните приведенный код, используя цикл for и встроенную функцию max(), чтобы он выводил максимальный элемент среди всех элементов вложенных списков списка list1.

list1 = [[1, 7, 8], [9, 7, 102], [6, 106, 105], [100, 99, 98, 103], [1, 2, 3]]
print(max([max(item) for item in list1]))

# 24. Дополните приведенный код так, чтобы список list1 имел вид:
#     list1 = [[8, 7, 1], [102, 7, 9], [105, 106, 102], [103, 98, 99, 100], [3, 2, 1]]

list1 = [[1, 7, 8], [9, 7, 102], [102, 106, 105], [100, 99, 98, 103], [1, 2, 3]]
print([item[::-1] for item in list1])

# 25. Дополните приведенный код так, чтобы он выводил единственное число: сумму всех чисел списка list1, разделённую на общее количество всех чисел.

list1 = [[1, 7, 8], [9, 7, 102], [102, 106, 105], [100, 99, 98, 103], [1, 2, 3]]
total = sum([sum(item) for item in list1])
counter = sum([len(item) for item in list1])
print(total / counter)

# 26. На вход программе подается число n. Напишите программу, которая создает и выводит построчно список, состоящий из n списков [[1, 2, ..., n], [1, 2, ..., n], ..., [1, 2, ..., n]].
# 
#     Формат входных данных
#     На вход программе подается натуральное число n.
# 
#     Формат выходных данных
#     Программа должна вывести построчно указанный список.

n = int(input())
lst = [i for i in range(1, n + 1)]
print(*[lst for _ in lst], sep='\n')

# 27. На вход программе подается число n. Напишите программу, которая создает и выводит построчно вложенный список, состоящий из n списков [[1], [1, 2], [1, 2, 3], ..., [1, 2, ..., n]].
# 
#     Формат входных данных
#     На вход программе подается натуральное число n.
# 
#     Формат выходных данных
#     Программа должна вывести построчно указанный вложенный список.

n = int(input())
lst = [i for i in range(1, n + 1)]
print(*[lst[:i] for i in lst], sep='\n')

# 28. Треугольник Паскаля — бесконечная таблица биномиальных коэффициентов, имеющая треугольную форму. В этом треугольнике на вершине и по бокам стоят единицы. Каждое число равно сумме двух расположенных над ним чисел.
# 
#     0:      1
#     1:     1 1
#     2:    1 2 1
#     3:   1 3 3 1
#     4:  1 4 6 4 1
#           .....
# 
#     На вход программе подается число n. Напишите программу, которая возвращает указанную строку треугольника Паскаля в виде списка (нумерация строк начинается с нуля).
# 
#     Формат входных данных
#     На вход программе подается число n (n≥0).
# 
#     Формат выходных данных
#     Программа должна вывести указанную строку треугольника Паскаля в виде списка.

def pascal(n):
    triangle = [[1] + [0]*n for i in range(n+1)]
    for i in range(1, n+1):
        for j in range(1, i+1):
            triangle[i][j] = triangle[i-1][j] + triangle[i-1][j-1]    
    return(triangle[-1])

print(pascal(int(input())))

# 29. На вход программе подается натуральное число n. Напишите программу, которая выводит первые n строк треугольника Паскаля.
# 
#     Формат входных данных
#     На вход программе подается число n (n≥1).
# 
#     Формат выходных данных
#     Программа должна вывести первые n строк треугольника Паскаля, каждую на отдельной строке в соответствии с образцом.

n = int(input())
triangle = [[1] + [0]*n for _ in range(n+1)]
for i in range(1, n+1):
    for j in range(1, i+1):
        triangle[i][j] = triangle[i-1][j] + triangle[i-1][j-1]
for i in range(n):
    for j in range(i+1):
        print(triangle[i][j], end=' ')
    print()

# 30. На вход программе подается строка текста, содержащая символы. 
#     Напишите программу, которая упаковывает последовательности одинаковых символов заданной строки в подсписки.
# 
#     Формат входных данных
#     На вход программе подается строка текста, содержащая символы, отделенные символом пробела.
# 
#     Формат выходных данных
#     Программа должна вывести указанный вложенный список.
    
lst = [i for i in input().split()]
result = []

for i in lst:
    if result and i in result[-1]:
        result[-1].append(i)
    else:
        result.append([i])

print(result)

# 31. На вход программе подаются две строки: на одной – символы, на другой – число n. Из первой строки формируется список.
#     Реализуйте функцию chunked(), которая принимает на вход список и число, задающее размер чанка (куска), а возвращает список из чанков (кусков) указанной длины.
# 
#     Формат входных данных
#     На вход программе подается строка текста, содержащая символы, отделенные символом пробела и число n на отдельной строке.
# 
#     Формат выходных данных
#     Программа должна вывести указанный вложенный список.
# 
#     Примечание. Не забудьте вызвать функцию chunked(), чтобы вывести результат 😀.

def chunked(lst, n):
    result = []
    for i in lst:
        if result and len(result[-1]) < n:
            result[-1].append(i)
        else:
            result.append([i])
    return result

print(chunked(input().split(), int(input())))

# 32. Подсписок — часть другого списка. Подсписок может содержать один элемент, несколько или даже ни одного. Например, [1], [2], [3] и [4] — подсписки списка [1, 2, 3, 4]. 
#     Список [2, 3] — подсписок списка [1, 2, 3, 4], но список [2, 4] не подсписок списка [1, 2, 3, 4], так как элементы 2 и 4 во втором списке не смежные 
#     (т. к. они разрываются элементом 3). Пустой список — подсписок любого списка. Сам список — подсписок самого себя, то есть список [1, 2, 3, 4] подсписок списка [1, 2, 3, 4].
#     На вход программе подается строка текста, содержащая символы. Из данной строки формируется список. Напишите программу, которая выводит список, 
#     содержащий все возможные подсписки списка, включая пустой список.
# 
#     Формат входных данных
#     На вход программе подается строка текста, содержащая символы, отделенные символом пробела.
# 
#     Формат выходных данных
#     Программа должна вывести указанный список, содержащий все возможные подсписки, включая пустой список в соответствии с примерами.
# 
#     Примечание. Порядок списков одинаковой длины должен соответствовать порядку их вхождения в основной список.

lst = input().split()
result, add = [[]], []

for i in range(len(lst)):
    for j in range(len(lst)):
        add = lst[j:i + j + 1]
        if len(add) == i + 1:
            result.append(add)
            
print(result)

# 33. На вход программе подаются два натуральных числа n и m, каждое на отдельной строке — количество строк и столбцов в матрице. 
#     Далее вводятся сами элементы матрицы — слова, каждое на отдельной строке; подряд идут элементы сначала первой строки, затем второй, и т.д.
#     Напишите программу, которая сначала считывает элементы матрицы один за другим, затем выводит их в виде матрицы.
# 
#     Формат входных данных
#     На вход программе подаются два числа n и m — количество строк и столбцов в матрице, далее идут n×m слов, каждое на отдельной строке.
# 
#     Формат выходных данных
#     Программа должна вывести считанную матрицу, разделяя ее элементы одним пробелом.

n, m = int(input()), int(input())
mtrx = [input() for _ in range(n*m)]
result = [mtrx[i:m+i] for i in range(0, len(mtrx), m)]
[print(*i) for i in result]

# 34. На вход программе подаются два натуральных числа n и m, каждое на отдельной строке — количество строк и столбцов в матрице. 
#     Далее вводятся сами элементы матрицы — слова, каждое на отдельной строке; подряд идут элементы сначала первой строки, затем второй, и т.д.
#     Напишите программу, которая считывает элементы матрицы один за другим, выводит их в виде матрицы, выводит пустую строку, и снова ту же матрицу, 
#     но уже поменяв местами строки со столбцами: первая строка выводится как первый столбец, и так далее.
# 
#     Формат входных данных
#     На вход программе подаются два числа n и m — количество строк и столбцов в матрице, далее идут n×m слов, каждое на отдельной строке.
# 
#     Формат выходных данных
#     Программа должна вывести считанную матрицу, за ней пустую строку и ту же матрицу, но поменяв местами строки со столбцами. Элементы матрицы разделять одним пробелом.

n, m = int(input()), int(input())
mtrx = [[input() for _ in range(m)] for _ in range(n)]

for i in range(n):
    for j in range(m):
        print(mtrx[i][j], end=' ')
    print()

print()

for i in range(m):
    for j in range(n):
        print(mtrx[j][i], end=' ')
    print()

# 35. Следом квадратной матрицы называется сумма элементов главной диагонали. Напишите программу, которая выводит след заданной квадратной матрицы.
# 
#     Формат входных данных
#     На вход программе подаётся натуральное число n — количество строк и столбцов в матрице, затем элементы матрицы (целые числа) построчно через пробел.
# 
#     Формат выходных данных
#     Программа должна вывести одно число — след заданной матрицы.
    
result = 0

for i in range(int(input())):
    result += int(input().split()[i])

print(result)

# 36. Напишите программу, которая выводит количество элементов квадратной матрицы в каждой строке, больших среднего арифметического элементов данной строки.
# 
#     Формат входных данных
#     На вход программе подаётся натуральное число n — количество строк и столбцов в матрице, затем элементы матрицы (целые числа) построчно через пробел.
# 
#     Формат выходных данных
#     Программа должна вывести n чисел — для каждой строки количество элементов матрицы, больших среднего арифметического элементов данной строки.

n = int(input())
mtrx = [list(map(int, input().split())) for i in range(n)]

for i in range(n):
    count = 0
    avg = sum(mtrx[i]) / n
    for j in range(n):
        if mtrx[i][j] > avg:
            count += 1
    print(count)

# 37. Напишите программу, которая выводит максимальный элемент в заштрихованной области квадратной матрицы.
# 
#     Формат входных данных
#     На вход программе подаётся натуральное число n — количество строк и столбцов в матрице, затем элементы матрицы (целые числа) построчно через пробел.
# 
#     Формат выходных данных
#     Программа должна вывести одно число — максимальный элемент в заштрихованной области квадратной матрицы.
# 
#     Примечание. Элементы главной диагонали также учитываются.
    
n = int(input())
mtrx = [list(map(int, input().split())) for _ in range(n)]
tmp = []

for i in range(n):
    for j in range(n):
        if i >= j:
            tmp.append(mtrx[i][j])
print(max(tmp))    

# 38. Напишите программу, которая выводит максимальный элемент в заштрихованной области квадратной матрицы.
# 
#     Формат входных данных
#     На вход программе подаётся натуральное число n — количество строк и столбцов в матрице, затем элементы матрицы (целые числа) построчно через пробел.
# 
#     Формат выходных данных
#     Программа должна вывести одно число — максимальный элемент в заштрихованной области квадратной матрицы.
# 
#     Примечание. Элементы диагоналей также учитываются.

n = int(input())
mtrx = [list(map(int, input().split())) for _ in range(n)]
maximum = mtrx[0][0]

for i in range(n):
    for j in range(n):
        if i >= j and i <= n - 1 - j and mtrx[i][j] > maximum or i <= j and i >= n - 1 - j and mtrx[i][j] > maximum:
            maximum = mtrx[i][j]
print(maximum)

# 39. Квадратная матрица разбивается на четыре четверти, ограниченные главной и побочной диагоналями: верхнюю, нижнюю, левую и правую.
#     Напишите программу, которая вычисляет сумму элементов: верхней четверти; правой четверти; нижней четверти; левой четверти.
# 
#     Формат входных данных
#     На вход программе подаётся натуральное число n — количество строк и столбцов в матрице, затем элементы матрицы (целые числа) построчно через пробел.
# 
#     Формат выходных данных
#     Программа должна вывести текст в соответствии с условием задачи.
# 
#     Примечание. Элементы диагоналей не учитываются.

n = int(input())
mtrx = [[*map(int, input().split())] for _ in range(n)]
top, right, bottom, left = [], [], [], []

for i in range(n):
    for j in range(n):
        if i < j and i < n - 1 - j:
            top.append(mtrx[i][j])
        elif i < j and i > n - 1 - j:
            right.append(mtrx[i][j])
        elif i > j and i > n - 1 - j:
            bottom.append(mtrx[i][j])
        elif i > j and i < n - 1 - j:
            left.append(mtrx[i][j])

print(f'''Верхняя четверть: {sum(top)}
Правая четверть: {sum(right)}
Нижняя четверть: {sum(bottom)}
Левая четверть: {sum(left)}''')

# 40. На вход программе подаются два натуральных числа n и m — количество строк и столбцов в матрице. Создайте матрицу mult размером n×m и заполните её таблицей умножения по формуле mult[i][j] = i * j.
# 
#     Формат входных данных
#     На вход программе на разных строках подаются два числа n и m — количество строк и столбцов в матрице.
# 
#     Формат выходных данных
#     Программа должна вывести таблицу умножения отводя на вывод каждого числа ровно 3 символа (для этого используйте строковый метод ljust()).

n, m = int(input()), int(input())
mult = [[i * j for j in range(m)] for i in range(n)]

for row in mult:
    print(*[str(r).ljust(2) for r in row])

# 41. На вход программе подаются два натуральных числа n и m — количество строк и столбцов в матрице, затем n строк по m целых чисел в каждой, отделенных символом пробела.
#     Напишите программу, которая находит индексы (строку и столбец) первого вхождения максимального элемента.
# 
#     Формат входных данных
#     На вход программе на разных строках подаются два числа n и m — количество строк и столбцов в матрице, затем сами элементы матрицы построчно через пробел.
# 
#     Формат выходных данных
#     Программа должна вывести два числа: номер строки и номер столбца, в которых стоит наибольший элемент таблицы. 
#     Если таких элементов несколько, то выводится тот, у которого меньше номер строки, а если номера строк равны то тот, у которого меньше номер столбца.
# 
#     Примечание. Считайте, что нумерация строк и столбцов начинается с нуля.
    
n, m = int(input()), int(input())
mtrx = [[*map(int, input().split())] for _ in range(n)]
maximum = mtrx[0][0]
max_index = '0 0'

for i in range(n):
    for j in range(m):
        if mtrx[i][j] > maximum:
            maximum = mtrx[i][j]
            max_index = f'{i} {j}'

print(max_index)