# 21. Дополните приведенный код, используя списочный метод append(), чтобы список list1 имел вид:
#     list1 = [10, 20, [300, 400, [5000, 6000, 7000], 500], 30, 40]

list1 = [10, 20, [300, 400, [5000, 6000], 500], 30, 40]
list1[2][2].append(7000)
print(list1)

# 22. Дополните приведенный код, используя списочный метод extend(), чтобы список list1 имел вид:
#     list1 = ['a', 'b', ['c', ['d', 'e', ['f', 'g', 'h', 'i', 'j'], 'k'], 'l'], 'm', 'n']
#     Подсписок для расширения  sub_list = ['h', 'i', 'j'].

list1 = ['a', 'b', ['c', ['d', 'e', ['f', 'g'], 'k'], 'l'], 'm', 'n']
sub_list = ['h', 'i', 'j']
list1[2][1][2].extend(['h', 'i', 'j'])
print(list1)