# 454. Ниже представлен код, который вам нужно будет дописать.
#      В переменную from_10_to_20 при помощи генератора-выражения сохраните последовательность от 10 до 20 включительно.
#      Затем при помощи функции next выведите первые три элемента. И остается вывести оставшиеся элементы в цикле.

from_10_to_20 = (i for i in range(10, 21))

print(next(from_10_to_20))
print(next(from_10_to_20))
print(next(from_10_to_20))

for value in from_10_to_20:
    print(value)

# 455. Перед вами список words. Необходимо сохранить в переменной lens генератор-выражение, который генерирует длины слов списка words по порядку.
#      Больше от вас в этой задаче ничего не требуется.

words = ['feel', 'graduate', 'movie', 'fashionable', 'bacon', 'drop', 'produce', 'acquisition',
         'cheap', 'strength', 'master', 'perception', 'noise', 'strange', 'am']

lens = (len(word) for word in words)

for i in lens:
    print(i)

# 456. Давайте напишем выражение-генератор, который будет генерировать кортеж состоящий из двух элементов: названия дня недели и номер дня в году.
#      За начало отсчета возьмем наш «любимый» 2022 год. Он начался в субботу, потом воскресенье, понедельник, вторник, ..., пятница, суббота и далее по кругу.
#      Результат выражения-генератор сохраните в переменную days.
#      Названия дней недели должны совпадать с этими значениями: ['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday'].
#      Значит при первой итерации генератор должен вернуть кортеж:
#      (1, 'Saturday')
#      При второй итерации вернется значение:
#      (2, 'Sunday')
#      Ваша задача распечатать на удачу 77 первых дней 2022 года. Выводить на экран нужно сами кортежи и первые десять значений в выводе должны выглядеть вот так:
#      (1, 'Saturday')
#      (2, 'Sunday')
#      (3, 'Monday')
#      (4, 'Tuesday')
#      (5, 'Wednesday')
#      (6, 'Thursday')
#      (7, 'Friday')
#      (8, 'Saturday')
#      (9, 'Sunday')
#      (10, 'Monday')

day = ['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday']
days = ((i + 1, day[(5 + i) % 7]) for i in range(77))
for _ in range(77):
    print(next(days))