# Домашнее задание 1:
# 
# 1.1
#   1) Установите Python и PyCharm
#   2) Напишите и запустите программу. которая выводит строку  "Hello world!" 
#   3) Напишите программу, которая на входе получает имя пользователя, cохраняет его в переменную user_name и выводит строку  "Hello {user_name}!" 
#   4) Напишите программу, которая на входе получает 2 числа, производит с ними арифметическую операцию(на ваше усмотрение), и выводит “Результат = {результат}”.

print('Hello world!')

user_name = input('Введите имя: ')
print(f'Hello, {user_name}')

x = int(input('Введите x: '))
y = int(input('Введите y: '))
print('Результат =', x + y)

# 1.2
#   1) Напишите программу, чтобы вывести:
#   
#   *********
#   *       *
#   *       *
#   *********

print('*' * 9, '*' + ' ' * 7 + '*', '*' + ' ' * 7 + '*', '*' * 9, sep='\n')