# 69. Напишите программу, которая считывает длины двух катетов в прямоугольном треугольнике и выводит
#     его площадь.
#     На вход программе подаётся два числа с плавающей точкой – длины катетов, каждое на отдельной строке.
#     Программа должна вывести одно число – площадь треугольника.

a = float(input())
b = float(input())
print(0.5 * a * b)

# 70. Две старушки идут навстречу друг другу с постоянными скоростями V1 и V2 км/ч. Определите, через какое
#     время старушки встретятся, если расстояние между ними равно S км.
#     На вход программе подаются три числа с плавающей точкой S,V1,V2, каждое на отдельной строке.
#     Программа должна вывести одно число в соответствии с условием задачи.

s = float(input())
v1 = float(input())
v2 = float(input())
print(s / (v1 + v2))

# 71. Напишите программу, которая считывает с клавиатуры одно число и выводит обратное ему. Если при этом
#     введённое с клавиатуры число – ноль, то вывести «Обратного числа не существует» (без кавычек).
#     На вход программе подается одно действительное число.
#     Программа должна вывести действительное число обратное данному, либо текст в соответствии с условием
#     задачи.

x = float(input())
if x == 0:
    print('Обратного числа не существует')
else:
    print(1 / x)

# 72. У известного американского писателя Рэя Бредбери есть роман «451 градус по Фаренгейту». Напишите
#     программу, которая определяет, какой температуре по шкале Цельсия соответствует указанное значение по
#     шкале Фаренгейта.
#     На вход программе подаётся вещественное число градусов по шкале Фаренгейта. Программа должна
#     вывести число градусов по шкале Цельсия.

f = float(input())
print(5 / 9 * (f - 32))

# 73. На вход программе подается число n – количество собачьих лет. Напишите программу, которая вычисляет
#     возраст собаки в человеческих годах.
#     На вход программе подаётся натуральное число – количество собачьих лет. Программа должна вывести
#     возраст собаки в человеческих годах. В течение первых двух лет собачий год равен 10.5 человеческим
#     годам. После этого каждый год собаки равен 4 человеческим годам.

age = float(input())
if 1 <= age <= 2:
    print(age * 10.5)
else:
    print(21 + (age - 2) * 4)

# 74. Дано положительное действительное число. Выведите его первую цифру после десятичной точки.
#     На вход программе подается положительное действительное число. Программа должна вывести цифру в
#     соответствии с условием задачи.

x = float(input())
y = int(x * 10) % 10
print(y)

# 75. Дано положительное действительное число. Выведите его дробную часть.
#     На вход программе подается положительное действительное число. Программа должна вывести дробную
#     часть числа в соответствии с условием задачи.

x = float(input())
y = x - int(x)
print(y)

# 76. Напишите программу, которая находит наименьшее и наибольшее из пяти чисел.
#     На вход программе подается пять целых чисел, каждое на отдельной строке. Программа должна вывести
#     наименьшее и наибольшее число с поясняющей надписью.

a = int(input())
b = int(input())
c = int(input())
d = int(input())
e = int(input())
print('Наименьшее число =', min(a, b, c, d, e))
print('Наибольшее число =', max(a, b, c, d, e))

# 77. Напишите программу, которая упорядочивает три числа от большего к меньшему.
#     На вход программе подается три целых числа, каждое на отдельной строке. Программа должна вывести три
#     числа, каждое на отдельной строке, упорядоченных от большего к меньшему.

a, b, c = int(input()), int(input()), int(input())
x = max(a, b, c)
y = min(a, b, c)
z = a + b + c - x - y
print(x)
print(z)
print(y)

# 78. Назовем число интересным, если в нем разность максимальной и минимальной цифры равняется средней
#     по величине цифре. Напишите программу, которая определяет интересное число или нет. Если число
#     интересное, следует вывести – «Число интересное» иначе «Число неинтересное».
#     На вход программе подается целое трехзначное число. Программа должна вывести текст в соответствии с
#     условием задачи.

x = int(input())
x3 = x % 10
x2 = x % 100 // 10
x1 = x // 100
if max(x1, x2, x3) - min(x1, x2, x3) == x1 + x2 + x3 - max(x1, x2, x3) - min(x1, x2, x3):
    print('Число интересное')
else:
    print('Число неинтересное')

# 79. Даны пять чисел a1,a2,a3,a4,a5. Напишите программу, которая вычисляет сумму их модулей ∣a1∣+ ∣a2∣+∣a3
#     ∣+∣a4∣+ ∣a5∣.
#     На вход программе подается пять действительных чисел a1,a2,a3,a4,a5, каждое на отдельной строке.
#     Программа должна вывести одно число – сумму модулей введённых чисел.

a1 = float(input())
a2 = float(input())
a3 = float(input())
a4 = float(input())
a5 = float(input())
b1 = abs(a1)
b2 = abs(a2)
b3 = abs(a3)
b4 = abs(a4)
b5 = abs(a5)
print(b1 + b2 + b3 + b4 + b5)

# 80. Прогуливаясь по Манхэттену, вы не можете попасть из точки А в точку Б по кратчайшему пути. Если только
#     вы не умеете проходить сквозь стены, вам обязательно придется идти вдоль его параллельно
#     перпендикулярных улиц. На плоскости манхэттенское расстояние между двумя точками (p1;p2) и 
#     (q1;q2) определяется так ∣p1−q1∣+∣p2−q2∣.
#     Напишите программу определяющую манхэттенское расстояние между двумя точками, координаты
#     которых заданы.
#     На вход программе подается четыре целых числа, каждое на отдельной строке – p1,p2,q1,q2. Программа
#     должна вывести одно число – манхэттенское расстояние.

p1 = int(input())
p2 = int(input())
q1 = int(input())
q2 = int(input())
print(abs(p1 - q1) + abs(p2 - q2))

# 81. Напишите программу, которая выводит текст:
#
#     "Python is a great language!", said Fred. "I don't ever remember having this much fun before."
#
#     Используйте конкатенацию строк.

print('"Python is a great language!", said Fred. "I don' + "'t" + ' ever remember having this much fun before."')

# 82. Напишите программу, которая считывает с клавиатуры две строки – имя и фамилию пользователя и
#     выводит фразу:
#
#     «Hello [введенное имя] [введенная фамилия]! You just delved into Python».
#
#     На вход программе подаётся две строки (имя и фамилия), каждая на отдельной строке. Программа должна
#     вывести текст в соответствии с условием задачи.

firstname = input()
lastname = input()
print('Hello', firstname, lastname + '! You just delved into Python')

# 83. Напишите программу, которая считывает с клавиатуры название футбольной команды и выводит фразу:
#
#     «Футбольная команда [введённая строка] имеет длину [длина введённой строки] символов».
#
#     На вход программе подаётся строка – название футбольной команды. Программа должна вывести текст в
#     соответствии с условием задачи.

team = input()
print('Футбольная команда', team, 'имеет длину', len(team), 'символов')

# 84. Даны названия трех городов. Напишите программу, которая определяет самое короткое и самое
#     длинное название города.
#     На вход программе подаётся названия трех городов, каждое на отдельной строке. Программа должна
#     вывести самое короткое и длинное название города, каждое на отдельной строке. Гарантируется, что длины
#     названий всех трех городов различны.

city1 = input()
city2 = input()
city3 = input()
if len(city1) < len(city2) < len(city3):
    print(city1, city3, sep='\n')
elif len(city1) < len(city3) < len(city2):
    print(city1, city2, sep='\n')
elif len(city2) < len(city1) < len(city3):
    print(city2, city3, sep='\n')
elif len(city2) < len(city3) < len(city1):
    print(city2, city1, sep='\n')
elif len(city3) < len(city1) < len(city2):
    print(city3, city2, sep='\n')
elif len(city3) < len(city1) < len(city2):
    print(city3, city2, sep='\n')

# 85. Вводятся 3 строки в случайном порядке. Напишите программу, которая выясняет можно ли из длин этих
#     строк построить возрастающую арифметическую прогрессию.
#     На вход программе подаются три строки, каждая на отдельной строке. Программа должна вывести
#     строку «YES», если из длин введенных слов можно построить арифметическую прогрессию, «NO» в ином
#     случае.

a = len(input())
b = len(input())
c = len(input())
x = max(a, b, c)
y = min(a, b, c)
z = a + b + c - x - y
if z == (x + y) / 2:
    print('YES')
else:
    print('NO')

# 86. Напишите программу, которая считывает одну строку, после чего выводит «YES», если в введенной строке
#     есть подстрока «синий» и «NO» в противном случае.
#     На вход программе подается одна строка. Программа должна вывести текст в соответствии с условием
#     задачи.

s = input()
if 'синий' in s:
    print('YES')
else:
    print('NO')

# 87. Напишите программу, которая считывает одну строку, после чего выводит «YES», если в введённой строке
#     есть подстрока «суббота» или «воскресенье», и «NO» в противном случае.
#     На вход программе подается одна строка. Программа должна вывести текст в соответствии с условием
#     задачи.

s = input()
if 'суббота' in s or 'воскресенье' in s:
    print('YES')
else:
    print('NO')

# 88. Будем считать email адрес корректным, если в нем есть символ собачки (@) и точки. Напишите программу
#     проверяющую корректность email адреса.
#     На вход программе подаётся одна строка – email адрес. Программа должна вывести строку «YES», если email
#     адрес является корректным и «NO» в ином случае.

s = input()
if '@' in s and '.' in s:
    print('YES')
else:
    print('NO')

# 89. На плоскости евклидово расстояние между двумя точками (x1;y1) и (x2;y2) определяется так 
#     ρ=sqrt(x1−x2)2+(y1−y2)2.
# 
#     Напишите программу определяющую евклидово расстояние между двумя точками, координаты которых
#     заданы. На вход программе подается четыре вещественных числа, каждое на отдельной строке – x1,y1,x2,
#     y2. Программа должна вывести одно число – евклидово расстояние.

from math import *
x1 = float(input())
y1 = float(input())
x2 = float(input())
y2 = float(input())
p = sqrt((x1 - x2) ** 2 + (y1 - y2) ** 2)
print(p)

# 90. Напишите программу определяющую площадь круга и длину окружности по заданному радиусу R.
#     На вход программе подается одно вещественное число R. Программа должна вывести два числа – площадь
#     круга и длину окружности радиуса R.
 
from math import *
r = float(input())
print(pi * pow(r, 2))
print(2 * pi * r)

# 91. В математике выделяют следующие средние значения:
#
#     •	среднее арифметическое чисел a и b;
# 
#     •	среднее геометрическое чисел a и b;
# 
#     •	среднее гармоническое чисел a и b;
# 
#     •	среднее квадратичное чисел a и b.
#
#     На вход программе подается два вещественных числа a и b, каждое на отдельной строке.
#     Программа должна вывести 4 числа – среднее арифметическое, геометрическое, гармоническое и
#     квадратичное.

from math import *
a = float(input())
b = float(input())
print((a + b) / 2)
print(sqrt(a * b))
print( 2 * a * b / (a + b))
print(sqrt((a ** 2 + b ** 2 )/ 2))

# 92. Напишите программу, вычисляющую значение тригонометрического выражения sinx+cosx+tan2x по
#     заданному числу градусов x.
#     На вход программе подается одно вещественное число x измеряемое в градусах. Программа должна
#     вывести одно число – значение тригонометрического выражения. Тригонометрические функции принимают
#     аргумент в радианах. Модуль math содержит встроенную функцию radians(), которая переводит угол из
#     градусов в угол в радианах.

from math import *
x = float(input())
print(sin(radians(x)) + cos(radians(x)) + tan(radians(x)) ** 2)

# 93. Напишите программу, вычисляющую значение ⌈x⌉ +⌊x⌋ по заданному вещественному числу x.
#     На вход программе подается одно вещественное число x. Программа должна вывести одно число
#     – значение указанного выражения.

from math import *
x = float(input())
print(ceil(x) + floor(x))

# 94. Даны три вещественных числа a, b, c. Напишите программу, которая находит вещественные
#     корни квадратного уравнения ax2+bx+c=0.
#     На вход программе подается три вещественных числа, каждое на отдельной строке. Программа должна
#     вывести вещественные корни уравнения если они существуют или текст «Нет корней» в противном случае.
#     Если уравнение имеет два корня, то следует вывести их в порядке возрастания.

from math import *
a = float(input())
b = float(input())
c = float(input())
d = b ** 2 - 4 * a * c
if d == 0:
    print(-b / (2 * a))
elif d > 0:
    x1 = (-b - sqrt(d))/ (2 * a)
    x2 = (-b + sqrt(d))/ (2 * a)
    print(min(x1, x2))
    print(max(x1, x2))
elif d < 0:
    print('Нет корней')

# 95. Правильный многоугольник — выпуклый многоугольник, у которого равны все стороны и все углы между
#     смежными сторонами. Даны два числа: натуральное число n и вещественное число a. Напишите программу,
#     которая находит площадь указанного правильного многоугольника.
#     На вход программе подается два числа n и a, каждое на отдельной строке. Программа должна вывести
#     вещественное число – площадь многоугольника

from math import *
n = float(input())
a = float(input())
s = n * (a ** 2) / (4 * tan(pi / n))
print(s)