# 258. На вход программе подается строка с именем текстового файла. Напишите программу, которая выводит на экран его содержимое.
# 
#      Формат входных данных
#      На вход программе подается строка текста с именем существующего текстового файла.
# 
#      Формат выходных данных
#      Программа должна вывести содержимое указанного файла.
# 
#      Примечание 1. Считайте, что исполняемая программа и указанный файл находятся в одной папке.
#      Примечание 2. Не забудьте закрыть файл 🙂.

f = open(input())
print(f.read())
f.close()

# 259. На вход программе подается строка с именем текстового файла. Напишите программу, которая выводит на экран его предпоследнюю строку.
# 
#      Формат входных данных
#      На вход программе подается строка текста с именем существующего текстового файла.
# 
#      Формат выходных данных
#      Программа должна вывести предпоследнюю строку указанного файла.
# 
#      Примечание 1. Считайте, что исполняемая программа и указанный файл находятся в одной папке.
#      Примечание 2. Гарантируется, что файл содержит хотя бы две строки.
#      Примечание 3. Не забудьте закрыть файл 🙂.

f = open(input())
print(f.readlines()[-2])
f.close()

# 260. Вам доступен текстовый файл lines.txt из нескольких строк. Напишите программу, которая выводит на экран случайную строку из этого файла.
#  
#      Формат входных данных
#      На вход программе ничего не подается.
# 
#      Формат выходных данных
#      Программа должна вывести случайную строку указанного файла.
# 
#      Примечание 1. Считайте, что исполняемая программа и указанный файл находятся в одной папке.
#      Примечание 2. Гарантируется, что файл содержит хотя бы одну строку.
#      Примечание 3. Не забудьте закрыть файл 🙂.
#      Примечание 4. Указанный файл можно скачать по ссылке.

f = open('lines.txt', 'rt', encoding='utf-8')
print(f.readlines()[__import__('random').randint(0, 5)])
f.close()

# 261. Вам доступен текстовый файл numbers.txt из двух строк, на каждой из них записано целое число. Напишите программу, выводящую на экран сумму этих чисел.
# 
#      Формат входных данных
#      На вход программе ничего не подается.
# 
#      Формат выходных данных
#      Программа должна вывести сумму чисел из указанного файла.
# 
#      Примечание 1. Считайте, что исполняемая программа и указанный файл находятся в одной папке.
#      Примечание 2. Не забудьте закрыть файл 🙂.
#      Примечание 3. Указанный файл можно скачать по ссылке.

f = open('numbers.txt')
print(sum(list(map(int, map(lambda line: line.strip(), f.readlines())))))
f.close()

# 262. Вам доступен текстовый файл nums.txt. В файле записано два целых числа, они могут быть разделены символами пробела и конца строки. 
#      Напишите программу, выводящую на экран сумму этих чисел.
# 
#      Формат входных данных
#      На вход программе ничего не подается.
# 
#      Формат выходных данных
#      Программа должна вывести сумму чисел из указанного файла.
# 
#      Примечание 1. Считайте, что исполняемая программа и указанный файл находятся в одной папке.
#      Примечание 2. Не забудьте закрыть файл 🙂.
#      Примечание 3. Указанный файл можно скачать по ссылке.

f = open('nums.txt')
print(sum([int(n) for n in f.read().split()]))
f.close()

# 263. Вам доступен текстовый файл prices.txt с информацией о заказе из интернет магазина. В нем каждая строка с помощью символа табуляции (\t) разделена на три колонки:
#      1. наименование товара;
#      2. количество товара (целое число);
#      3. цена (в рублях) товара за 1 шт (целое число).
#      Напишите программу, выводящую на экран общую стоимость заказа.
# 
#      Формат входных данных
#      На вход программе ничего не подается.
# 
#      Формат выходных данных
#      Программа должна вывести общую стоимость заказа.
# 
#      Примечание 1. Считайте, что исполняемая программа и указанный файл находятся в одной папке.
#      Примечание 2. Не забудьте закрыть файл 🙂.
#      Примечание 3. Указанный файл можно скачать по ссылке.

f = open('prices.txt')
print(sum([int(n.split()[1]) * int(n.split()[-1]) for n in f.readlines()]))
f.close()