# 258. На вход программе подается строка с именем текстового файла. Напишите программу, которая выводит на экран его содержимое.
#
#      Формат входных данных
#      На вход программе подается строка текста с именем существующего текстового файла.
#
#      Формат выходных данных
#      Программа должна вывести содержимое указанного файла.
#
#      Примечание 1. Считайте, что исполняемая программа и указанный файл находятся в одной папке.
#      Примечание 2. Не забудьте закрыть файл 🙂.

f = open(input())
print(f.read())
f.close()

# 259. На вход программе подается строка с именем текстового файла. Напишите программу, которая выводит на экран его предпоследнюю строку.
#
#      Формат входных данных
#      На вход программе подается строка текста с именем существующего текстового файла.
#
#      Формат выходных данных
#      Программа должна вывести предпоследнюю строку указанного файла.
#
#      Примечание 1. Считайте, что исполняемая программа и указанный файл находятся в одной папке.
#      Примечание 2. Гарантируется, что файл содержит хотя бы две строки.
#      Примечание 3. Не забудьте закрыть файл 🙂.

f = open(input())
print(f.readlines()[-2])
f.close()

# 260. Вам доступен текстовый файл lines.txt из нескольких строк. Напишите программу, которая выводит на экран случайную строку из этого файла.
#
#      Формат входных данных
#      На вход программе ничего не подается.
#
#      Формат выходных данных
#      Программа должна вывести случайную строку указанного файла.
#
#      Примечание 1. Считайте, что исполняемая программа и указанный файл находятся в одной папке.
#      Примечание 2. Гарантируется, что файл содержит хотя бы одну строку.
#      Примечание 3. Не забудьте закрыть файл 🙂.
#      Примечание 4. Указанный файл можно скачать по ссылке.

f = open('lines.txt', 'rt', encoding='utf-8')
print(f.readlines()[__import__('random').randint(0, 5)])
f.close()

# 261. Вам доступен текстовый файл numbers.txt из двух строк, на каждой из них записано целое число. Напишите программу, выводящую на экран сумму этих чисел.
#
#      Формат входных данных
#      На вход программе ничего не подается.
#
#      Формат выходных данных
#      Программа должна вывести сумму чисел из указанного файла.
#
#      Примечание 1. Считайте, что исполняемая программа и указанный файл находятся в одной папке.
#      Примечание 2. Не забудьте закрыть файл 🙂.
#      Примечание 3. Указанный файл можно скачать по ссылке.

f = open('numbers.txt')
print(sum(list(map(int, map(lambda line: line.strip(), f.readlines())))))
f.close()

# 262. Вам доступен текстовый файл nums.txt. В файле записано два целых числа, они могут быть разделены символами пробела и конца строки.
#      Напишите программу, выводящую на экран сумму этих чисел.
#
#      Формат входных данных
#      На вход программе ничего не подается.
#
#      Формат выходных данных
#      Программа должна вывести сумму чисел из указанного файла.
#
#      Примечание 1. Считайте, что исполняемая программа и указанный файл находятся в одной папке.
#      Примечание 2. Не забудьте закрыть файл 🙂.
#      Примечание 3. Указанный файл можно скачать по ссылке.

f = open('nums.txt')
print(sum([int(n) for n in f.read().split()]))
f.close()

# 263. Вам доступен текстовый файл prices.txt с информацией о заказе из интернет магазина. В нем каждая строка с помощью символа табуляции (\t) разделена на три колонки:
#      1. наименование товара;
#      2. количество товара (целое число);
#      3. цена (в рублях) товара за 1 шт (целое число).
#      Напишите программу, выводящую на экран общую стоимость заказа.
#
#      Формат входных данных
#      На вход программе ничего не подается.
#
#      Формат выходных данных
#      Программа должна вывести общую стоимость заказа.
#
#      Примечание 1. Считайте, что исполняемая программа и указанный файл находятся в одной папке.
#      Примечание 2. Не забудьте закрыть файл 🙂.
#      Примечание 3. Указанный файл можно скачать по ссылке.

f = open('prices.txt')
print(sum([int(n.split()[1]) * int(n.split()[-1]) for n in f.readlines()]))
f.close()

# 264. Вам доступен текстовый файл text.txt с одной строкой текста. Напишите программу, которая выводит на экран эту строку в обратном порядке.
#
#      Формат входных данных
#      На вход программе ничего не подается.
#
#      Формат выходных данных
#      Программа должна вывести строку указанного файла в обратном порядке.
#
#      Примечание 1. Считайте, что исполняемая программа и указанный файл находятся в одной папке.
#      Примечание 2. Используйте менеджер контекста 🙂.
#      Примечание 3. Указанный файл можно скачать по ссылке.

with open('text.txt', encoding='utf-8') as f:
    for line in f.read()[::-1]:
        print(line, end='')

# 265. Вам доступен текстовый файл data.txt, в котором записаны строки текста.
#      Напишите программу, выводящую все строки данного файла в обратном порядке: сначала последнюю, затем предпоследнюю и т.д.
#
#      Формат входных данных
#      На вход программе ничего не подается.
#
#      Формат выходных данных
#      Программа должна вывести строки указанного файла в обратном порядке, каждую на новой строке.
#
#      Примечание 1. Считайте, что исполняемая программа и указанный файл находятся в одной папке.
#      Примечание 2. Используйте менеджер контекста 🙂.
#      Примечание 3. Получить список всех строк файла можно при помощи метода readlines().
#      Примечание 4. Не забывайте про символ конца строки '\n'.
#      Примечание 5. Указанный файл можно скачать по ссылке.

with open('data.txt', encoding='utf-8') as f:
    for line in [c.strip() for c in f.readlines()][::-1]:
        print(line)

# 266. Вам доступен текстовый файл lines.txt, в котором записаны строки текста. Напишите программу, которая выводит все строки наибольшей длины из файла, не меняя их порядок.
#
#      Формат входных данных
#      На вход программе ничего не подается.
#
#      Формат выходных данных
#      Программа должна вывести строки указанного файла, имеющие наибольшую длину, не меняя их порядка.
#
#      Примечание 1. Считайте, что исполняемая программа и указанный файл находятся в одной папке.
#      Примечание 2. Используйте менеджер контекста 🙂.
#      Примечание 3. Если бы файл lines.txt содержал строки:
#      One
#      Twenty one
#      Two
#      Twenty two
#      то результатом будет:
#      Twenty one
#      Twenty two
#      Примечание 4. Указанный файл можно скачать по ссылке.

with open('lines.txt', encoding='utf-8') as f:
    lines = [c.strip() for c in f.readlines()]
    for line in lines:
        if len(line) == len(max(lines, key=len)):
            print(line)

# 267. Вам доступен текстовый файл numbers.txt, каждая строка которого может содержать одно или несколько целых чисел, разделенных одним или несколькими пробелами.
#      Напишите программу, которая вычисляет сумму чисел в каждой строке и выводит эту сумму на экран (для каждой строки выводится сумма чисел в этой строке).
#
#      Формат входных данных
#      На вход программе ничего не подается.
#
#      Формат выходных данных
#      Программа должна вывести сумму чисел в каждой строке.
#
#      Примечание 1. Если бы файл numbers.txt содержал строки:
#      2 1
#           3    40
#       10       7
#      то результатом было бы:
#      3
#      43
#      17
#      Примечание 2. Указанный файл можно скачать по ссылке.

with open('numbers.txt', encoding='utf-8') as f:
    print(*[sum([int(i) for i in __import__('re').findall(r'\d+', c)]) for c in f.readlines()], sep='\n')

# 268. Вам доступен текстовый файл nums.txt. В файле могут быть записаны целые неотрицательные числа и все, что угодно.
#      Числом назовем последовательность одной и более цифр, идущих подряд (число всегда неотрицательно).
#      Напишите программу, которая вычисляет сумму всех чисел, записанных в файле.
#
#      Формат входных данных
#      На вход программе ничего не подается.
#
#      Формат выходных данных
#      Программа должна вывести сумму всех чисел, записанных в файле.
#
#      Примечание 1. Если бы файл nums.txt содержал строки:
#       123   jhjk
#      bhjip456qwerty
#      1x2y3 4 5 6
#      sfsd 0 dfgfd
#      10abc20de30pop5 5 5 5
#      то результатом было бы:
#      680
#      Примечание 2. Указанный файл можно скачать по ссылке.

with open('nums.txt', encoding='utf-8') as f:
    print(sum([sum([int(i) for i in __import__('re').findall(r'\d+', c)]) for c in f.readlines()]))

# 269. Вам доступен текстовый файл file.txt, набранный латиницей. Напишите программу, которая выводит количество букв латинского алфавита, слов и строк.
#      Выведите три найденных числа в формате, приведенном в примере.
#
#      Формат входных данных
#      На вход программе ничего не подается.
#
#      Формат выходных данных
#      Программа должна вывести три найденных числа в формате, приведенном в примере.
#
#      Примечание 1. Если бы файл file.txt содержал строки:
#      Beautiful is better than ugly.
#      Explicit is better than implicit.
#      Simple is better than complex.
#      Complex is better than complicated.
#      то результатом было бы:
#      Input file contains:
#      108 letters
#      20 words
#      4 lines
#      Примечание 2. Словом называется последовательность из непробельных символов. Например, строка
#      abc a21 67pop    qwert bo7ok 83456
#      содержит 6 слов: abc, a21, 67pop, qwert, bo7ok, 83456.
#      Примечание 3. Указанный файл можно скачать по ссылке.

with open('file.txt', encoding='utf-8') as f:
    text = f.readlines()
    print('Input file contains:')
    print(f'{sum([len([i for i in c if i.isalpha()]) for c in text])} letters')
    print(f'{sum([len([i for i in c.split()]) for c in text])} words')
    print(f'{len([c.strip() for c in text])} lines')

# 270. Вам доступны два текстовых файла first_names.txt и last_names.txt, один с именами, другой с фамилиями.
#      Напишите программу, которая c помощью модуля random создает 3 случайные пары имя + фамилия, а затем выводит их, каждую на отдельной строке.
#
#      Формат входных данных
#      На вход программе ничего не подается.
#
#      Формат выходных данных
#      Программа должна вывести текст в формате, приведенном в примере.
#
#      Примечание 1. Если бы файлы first_names.txt и last_names.txt содержали строки:
#      Aaron
#      Abdul
#      Abe
#      Abel
#      Abraham
#      Albert
#      и
#      Abramson
#      Adamson
#      Adderiy
#      Addington
#      Adrian
#      Albertson
#      Einstein
#      то результатом могло быть:
#      Abdul Albertson
#      Abel Adamson
#      Albert Einstein
#      Примечание 2. Указанные файлы можно скачать по ссылкам (имена, фамилии).

from random import sample

with open('first_names.txt', encoding='utf-8') as f_name, open('last_names.txt', encoding='utf-8') as l_name:
    first_name = f_name.read().split()
    last_name = l_name.read().split()
    print(*[f'{i} {j}' for i, j in zip(sample(first_name, 3), sample(last_name, 3))], sep='\n')

# 271. Вам доступен текстовый файл population.txt с названиями стран и численностью их населения, разделенными символом табуляции '\t'.
#      Напишите программу выводящую все страны, название которых начинается с буквы 'G', численность населения которых больше чем 500000 человек, не меняя их порядок.
# 
#      Формат входных данных
#      На вход программе ничего не подается.
# 
#      Формат выходных данных
#      Программа должна вывести названия стран, удовлетворяющие условиям задачи, каждое на отдельное строке.
# 
#      Примечание. Указанный файл можно скачать по ссылке.

with open('population.txt') as f:
    for line in f.readlines():
        if line.startswith('G') and int(line.strip().split()[-1]) > 500000:
            print(line.strip().split()[0])

# 272. Вам доступен CSV-файл data.csv, содержащий информацию в csv формате. Напишите функцию read_csv для чтения данных из этого файла. 
#      Она должна возвращать список словарей, интерпретируя первую строку как имена ключей, а каждую последующую строку как значения этих ключей.
# 
#      Формат входных данных
#      На вход программе ничего не подается.
# 
#      Формат выходных данных
#      Программа должна содержать реализованную функцию read_csv.
# 
#      Примечание 1. Вызывать функцию read_csv не нужно.
#      Примечание 2. Функция read_csv не должна принимать аргументов. 
#      Примечание 3. Подробнее прочитать про CSV-файлы можно тут.
#      Примечание 4. Считайте, что все ключи и значения по этим ключам в результирующем словаре имеют строковый тип (str).
#      Примечание 5. Указанный файл можно скачать по ссылке.
#      Примечание 6. Если бы файл data.csv содержал информацию
#      name,address,age
#      George,4312 Abbey Road,22
#      John,54 Love Ave,21
#      то вызов функции read_csv() вернул бы список:
#      [{'name': 'George', 'address': '4312 Abbey Road', 'age': '22'}, {'name': 'John', 'address': '54 Love Ave', 'age': '21'}]

def read_csv():

    with open('data.csv') as f:
        k = f.readline().strip().split(',')
        return [dict(zip(k, line.strip().split(','))) for line in f]