# 35. При регистрации на сайтах требуется вводить пароль дважды. Это сделано для безопасности,
#     поскольку такой подход уменьшает возможность неверного ввода пароля. Напишите программу, которая
#     сравнивает пароль и его подтверждение. Если они совпадают, то программа выводит: «Пароль принят»,
#     иначе: «Пароль не принят». На вход программе подаются две строки. Программа должна вывести одну
#     строку в соответствии с условием задачи.

pass1, pass2 = input(), input()
if pass1 == pass2:
    print('Пароль принят')
else:
    print('Пароль не принят')

# 36. Напишите программу, которая определяет, является число четным или нечетным. На вход программе
#     подаётся одно целое число. Программа должна вывести «Четное», если число четное, и «Нечетное» — если
#     число нечетное.

num = int(input())
if num % 2 == 0:
    print('Четное')
else:
    print('Нечетное')

# 37. Напишите программу, которая проверяет, что для заданного четырехзначного числа выполняется
#     следующее соотношение: сумма первой и последней цифр равна разности второй и третьей цифр. На вход
#     программе подаётся одно целое положительное четырёхзначное число. Программа должна вывести «ДА»,
#     если соотношение выполняется, и «НЕТ» — если не выполняется.

num = int(input())
num4 = num % 10
num3 = (num % 100) // 10
num2 = (num % 1000) // 100
num1 = num // 1000
if (num1 + num4) == (num2 - num3):
    print('ДА')
else:
    print('НЕТ')

# 38. Напишите программу, которая определяет, разрешен пользователю доступ к интернет-ресурсу или нет. На
#     вход программе подаётся целое число — возраст пользователя. Программа должна вывести текст «Доступ
#     разрешен» если возраст не менее 18, и «Доступ запрещен» в противном случае.

age = int(input())
if age >= 18:
    print('Доступ разрешен')
else:
    print('Доступ запрещен')

# 39. Напишите программу, которая определяет, являются ли три заданных числа (в указанном порядке)
#     последовательными членами арифметической прогрессии. На вход программе подаются три числа, каждое
#     на отдельной строке. Программа должна вывести «YES» или «NO» (без кавычек) в соответствии с условием
#     задачи. 

a, b, c = int(input()), int(input()), int(input())
if (b - a) == (c - b):
    print('YES')
else:
    print('NO')

# 40. Напишите программу, которая определяет наименьшее из двух чисел. На вход программе подаётся два
#     различных целых числа. Программа должна вывести наименьшее из двух чисел.

a, b = int(input()), int(input())
if a - b < 0:
    print(a)
else:
    print(b)

# 41. Напишите программу, которая определяет наименьшее из четырёх чисел. На вход программе подаётся
#     четыре целых числа. Программа должна вывести наименьшее из четырёх чисел.

a, b, c, d = int(input()), int(input()), int(input()), int(input())
if a < b < c < d:
    print(a)
else:
    if b < c < d:
        print(b)
    else:
        if c < d:
            print(c)
        else:
            print(d)

# 42. Напишите программу, которая по введённому возрасту пользователя сообщает, к какой возрастной группе
#     он относится:
#     •	до 13 включительно – детство;
#     •	от 14 до 24 – молодость;
#     •	от 25 до 59 – зрелость;
#     •	от 60 – старость.
#     На вход программе подаётся одно целое число – возраст пользователя. Программа должна вывести
#     название возрастной группы.

age = int(input())
if age <= 13:
    print('детство')
else:
    if age <= 24:
        print('молодость')
    else:
        if age <=59:
            print('зрелость')
        else:
            print('старость')

# 43. Напишите программу, которая считывает три числа и подсчитывает сумму только положительных чисел.
#     На вход программе подаются три целых числа. Программа должна вывести одно число – сумму
#     положительных чисел.

a, b, c = int(input()), int(input()), int(input()),
count1 = 0
count2 = 0
count3 = 0
if a > 0:
    count1 = a
else:
    count1 = 0
if b > 0:
    count2 = b
else:
    count2 = 0
if c > 0:
    count3 = c
else:
    count3 = 0
print(count1 + count2 + count3)

# 44. Напишите программу, которая принимает целое число x и определяет, принадлежит ли данное число
#     указанному промежутку. На вход программе подаётся целое число x. Программа должна вывести текст в
#     соответствии с условием задачи. Если точка выколотая, то граница не включается, если точка
#     закрашенная, то граница включается.

x = int(input())
if -1 < x < 17:
    print('Принадлежит')
else:
    print('Не принадлежит')

# 45. Напишите программу, которая принимает целое число x и определяет, принадлежит ли данное число
#     указанным промежуткам. На вход программе подаётся целое число x. Программа должна вывести текст в
#     соответствии с условием задачи.

x = int(input())
if x <= -3 or x >= 7:
    print('Принадлежит')
else:
    print('Не принадлежит')

# 46. Напишите программу, которая принимает целое число x и определяет, принадлежит ли данное число
#     указанным промежуткам. На вход программе подаётся целое число x. Программа должна вывести текст в
#     соответствии с условием задачи.

x = int(input())
if -30 < x <= -2 or 7 < x <=25:
    print('Принадлежит')
else:
    print('Не принадлежит')

# 47. Назовем число красивым, если оно является четырехзначным и делится нацело на 77 или на 1717.
#     Напишите программу, определяющую, является ли введённое число красивым. Программа должна вывести
#     «YES», если число является красивым, или «NO» в противном случае. На вход программе подаётся
#     натуральное число.

x = int(input())
if (1000 <= x <= 9999) and (x % 7 == 0 or x % 17 == 0):
    print('YES')
else:
    print('NO')

# 48. Напишите программу, которая принимает три положительных числа и определяет, существует ли
#     невырожденный треугольник с такими сторонами. На вход программе подаётся три положительных целых
#     числа.

a, b, c = int(input()), int(input()), int(input())
if (a + b > c) and (a + c > b) and (b + c > a):
    print('YES')
else:
    print('NO')

# 49. Напишите программу, которая определяет, является ли год с данным номером високосным. Если год
#     является високосным, то выведите «YES», иначе выведите «NO».
#     Год является високосным, если его номер кратен 4, но не кратен 100, или если он кратен 400. На вход
#     программе подаётся натуральное число.

x = int(input())
if x % 4 == 0 and not (x % 100 == 0) or x % 400 == 0:
    print('YES')
else:
    print('NO')

# 50. Даны две различные клетки шахматной доски. Напишите программу, которая определяет, может ли ладья
#     попасть с первой клетки на вторую одним ходом. Программа получает на вход четыре числа от 1 до 8
#     каждое, задающие номер столбца и номер строки сначала для первой клетки, потом для второй клетки.
#     Программа должна вывести «YES», если из первой клетки ходом ладьи можно попасть во вторую, или
#     «NO» в противном случае. На вход программе подаётся четыре числа от 1 до 8.

a, b, c, d = int(input()), int(input()), int(input()), int(input())
if (a != c and b == d) or (a == c and b != d):
    print('YES')
else:
    print('NO')

# 51. Даны две различные клетки шахматной доски. Напишите программу,  которая определяет, может ли
#     король попасть с первой клетки на вторую одним ходом. Программа получает на вход четыре числа от 1
#     до 8 каждое, задающие номер столбца и номер строки сначала для первой клетки, потом для второй
#     клетки. Программа должна вывести «YES», если из первой клетки ходом короля можно попасть во вторую,
#     или «NO» в противном случае. На вход программе подаётся четыре числа от 1 до 8.

a, b, c, d = int(input()), int(input()), int(input()), int(input())
if (c <= a + 1 and c >= a - 1) and (d <= b + 1 and d >= b - 1):
    print('YES')
else:
    print('NO')

# 52. Зум бросил вызов Флэшу и предложил ему честный поединок в виде гонки вокруг магнетара. В случае
#     проигрыша эта нейтронная звезда зарядится и уничтожит мир, поэтому Флэш решил не рисковать без
#     причины, и узнать у своего друга Циско Рамона есть ли смысл принимать вызов. Циско получил данные,
#     что скорость Зума равна n, а скорость Флэша равна k. Напишите программу, которая должна вывести
#     ответ Циско на вопрос Флэша.
#     На вход программе подаётся два целых числа n и k, скорость Зума и Флэша. Если Зум быстрее Флэша нужно
#     вывести «NO», если Флэш быстрее Зума нужно вывести «YES», если их скорости равны нужно вывести
#     "Don't know".

n, k = int(input()), int(input())
if n > k:
    print('NO')
else:
    if n < k:
        print('YES')
    else:
        if n == k:
            print("Don't know")

# 53. Напишите программу, которая принимает три положительных числа и определяет вид треугольника,
#     длины сторон которого равны введенным числам.
#     На вход программе подаются три числа – длины сторон существующего треугольника. Программа должна
#     вывести на экран текст – вид треугольника («Равносторонний», «Равнобедренный» или «Разносторонний»).

a, b, c = int(input()), int(input()), int(input())
if a == b == c:
    print('Равносторонний')
elif a != b != c and a != c:
    print('Разносторонний')
else:
    print('Равнобедренный')

# 54. Даны три различных целых числа. Напишите программу, которая находит среднее по величине число. На
#     вход программе подаётся три различных целых числа, каждое на отдельной строке. Программа должна
#     вывести среднее число. Средним называется число, которое будет вторым, если три числа отсортировать
#     в порядке возрастания.

a = int(input()) 
b = int(input())
c = int(input())
if b < a < c or c < a < b:
    print(a)
elif a < b < c or c < b < a:
    print(b)
else:
    print(c)

# 55. Дан порядковый номер месяца (1,2,…, 12). Напишите программу, которая выводит на экран количество
#     дней в этом месяце. Принять, что год является невисокосным. На вход программе подаётся одно целое
#     число – порядковый номер месяца. Программа должна вывести количество дней в этом месяце.

month = int(input())
if month == 1 or month == 3 or month == 5 or month == 7 or month == 8 or month == 10 or month == 12:
    print('31')
elif month == 2:
    print('28')
else:
    print('30')

# 56. Известен вес боксера-любителя (целое число). Известно, что вес таков, что боксер может быть отнесён к
#     одной из трех весовых категорий:
#     1.	Легкий вес – до 60 кг;
#     2.	Первый полусредний вес – до 64 кг;
#     3.	Полусредний вес – до 69 кг.
#     Напишите программу, определяющую, в какой категории будет выступать данный боксер.
#     На вход программе подаётся одно целое число. Программа должна вывести текст – название весовой
#     категории.

weight = int(input())
if weight < 60:
    print('Легкий вес')
elif 60 <= weight < 64:
    print('Первый полусредний вес')
else:
    print('Полусредний вес')

# 57. Напишите программу, которая считывает с клавиатуры два целых числа и строку. Если эта строка является
#     обозначением одной из четырёх математических операций (+, -, *, /), то выведите результат применения этой
#     операции к введённым ранее числам, в противном случае выведите «Неверная операция». Если
#     пользователь захочет поделить на ноль, выведите текст «На ноль делить нельзя!».
#     На вход программе подаются два целых числа, каждое на отдельной строке, и строка. Программа должна
#     вывести результат применения операции к введенным числам или соответствующий текст, если операция
#     неверная либо если происходит деление на ноль.

a = int(input())
b = int(input())
c = input()
if c == '+':
    print(a + b)
elif c == '-':
    print(a - b)
elif c == '*':
    print(a * b)
elif c == '/' and b != 0:
    print(a / b)
elif c == '/' and b == 0:
    print('На ноль делить нельзя!')
else:
    print('Неверная операция')

# 58. Красный, синий и желтый называются основными цветами, потому что их нельзя получить путем смешения
#     других цветов. При смешивании двух основных цветов получается вторичный цвет:
#     •	если смешать красный и синий, то получится фиолетовый;
#     •	если смешать красный и желтый, то получится оранжевый;
#     •	если смешать синий и желтый, то получится зеленый.
#     Напишите программу, которая считывает названия двух основных цветов для смешивания. Если
#     пользователь вводит что-нибудь помимо названий «красный», «синий» или «желтый», то программа
#     должна вывести сообщение об ошибке. В противном случае программа должна вывести название
#     вторичного цвета, который получится в результате.
#     На вход программе подаются две строки, каждая на отдельной строке. Программа должна вывести
#     полученный цвет смешения либо сообщение «ошибка цвета», если введён был не цвет. Если смешать
#     красный и красный, то получится красный и т.д.

color1, color2 = input(), input()
if (color1 != 'красный' and color1 != 'синий' and color1 != 'желтый') or (color2 != 'красный' and color2 != 'синий'
and color2 != 'желтый'):
    print('ошибка цвета')
elif color1 == color2:
    print(color1)
elif color1 == 'красный' and color2 == 'синий':
    print('фиолетовый')
elif color1 == 'красный' and color2 == 'желтый':
    print('оранжевый')
elif color1 == 'синий' and color2 == 'желтый':
    print('зеленый')
elif color2 == 'красный' and color1 == 'синий':
    print('фиолетовый')
elif color2 == 'красный' and color1 == 'желтый':
    print('оранжевый')
elif color2 == 'синий' and color1 == 'желтый':
    print('зеленый')

# 59. На колесе рулетки карманы пронумерованы от 0 до 36. Ниже приведены цвета карманов: 
#     •	карман 0 зеленый;
#     •	для карманов с 1 по 10 карманы с нечетным номером имеют красный цвет, карманы с четным номером – черный;
#     •	для карманов с 11 по 18 карманы с нечетным номером имеют черный цвет, карманы с четным номером – красный;
#     •	для карманов с 19 по 28 карманы с нечетным номером имеют красный цвет, карманы с четным номером – черный;
#     •	для карманов с 29 по 36 карманы с нечетным номером имеют черный цвет, карманы с четным номером – красный.
#     Напишите программу, которая считывает номер кармана и показывает, является ли этот карман зеленым,
#     красным или черным. Программа должна вывести сообщение об ошибке, если пользователь вводит число,
#     которое лежит вне диапазона от 0 до 36.
#     На вход программе подаётся одно целое число. Программа должна вывести цвет кармана либо сообщение
#     «ошибка ввода», если введённое число лежит вне диапазона от 0 до 36.

x = int(input())
if x < 0 or x > 36:
    print('ошибка ввода')
elif x == 0:
    print('зеленый')
elif 0 < x <= 10 and x % 2 == 0:
    print('черный')
elif 0 < x <= 10 and x % 2 == 1:
    print('красный')
elif 11 <= x <= 18 and x % 2 == 0:
    print('красный')
elif 11 <= x <= 18 and x % 2 == 1:
    print('черный')
elif 19 <= x <= 28 and x % 2 == 0:
    print('черный')
elif 19 <= x <= 28 and x % 2 == 1:
    print('красный')
elif 29 <= x <= 36 and x % 2 == 0:
    print('красный')
elif 29 <= x <= 36 and x % 2 == 1:
    print('черный')

# 60. На числовой прямой даны два отрезка: [a1;  b1] и [a2; b2]. Напишите программу, которая находит их
#     пересечение.
#     Пересечением двух отрезков может быть:
#     •	отрезок;
#     •	точка;
#     •	пустое множество.
#     На вход программе подаются 4 целых числа a1,b1,a2,b2, каждое на отдельной строке. Гарантируется, что 
#     a1<b1 и a2<b2. Программа должна вывести на экран границы отрезка, являющегося пересечением, либо
#     общую точку, либо текст «пустое множество».

a1 = int(input())
b1 = int(input())
a2 = int(input())
b2 = int(input())
if a2 > b1:
    print('пустое множество')
elif a1 > b2:
    print('пустое множество')
elif a2 == b1:
    print(a2)
elif a1 == b2:
    print(a1)
elif a1 <= a2:
    if b1 <= b2:
        print(a2, b1)
    else:
        if a1 < a2:
            if b1 > b2:
                print(a2, b2)
elif a2 <= a1:
    if b2 <= b1:
        print(a1, b2)
    else:
        if a2 < a1:
            if b2 > b1:
                print(a1, b1)

# 61. Напишите программу, которая определяет, оканчивается ли год с данным номером на два нуля. Если год
#     оканчивается, то выведите «YES», иначе выведите «NO».
#     На вход программе подаётся натуральное число. Программа должна вывести текст в соответствии с
#     условием задачи

year = int(input())
year4 = year % 10
year3 = (year % 100) // 10
if year4 == year3 == 0:
    print('YES')
else:
    print('NO')

# 62. Заданы две клетки шахматной доски. Напишите программу, которая определяет имеют ли указанные клетки
#     один цвет или нет. Если они покрашены в один цвет, то выведите слово «YES», а если в разные цвета -
#     то «NO».
#     На вход программе подаётся четыре числа от 1 до 8 каждое, задающие номер столбца и номер строки
#     сначала для первой клетки, потом для второй клетки. Программа должна вывести текст в соответствии с
#     условием задачи.

a1 = int(input())
b1 = int(input())
a2 = int(input())
b2 = int(input())
if (a1 + a2 + b1 + b2) % 2 == 0:
    print('YES')
else:
    print('NO')

# 63. Футбольная команда набирает девочек от 10 до 15 лет включительно. Напишите программу, которая
#     запрашивает возраст и пол претендента, используя обозначение пола буквы m (от male – мужчина) и f (от
#     female – женщина) и определяет подходит ли претендент для вступления в команду или нет. Если
#     претендент подходит, то выведите «YES», иначе выведите «NO».
#     На вход программе подаётся натуральное число – возраст претендента и буква обозначающая пол m
#     (мужчина) или f (женщина). Программа должна вывести текст в соответствии с условием задачи.

age = int(input())
male = input()
if male == 'f' and 10 <= age <= 15:
    print('YES')
else:
    print('NO')

# 64. Напишите программу, которая считывает целое число и выводит соответствующую ему римскую цифру.
#     Если число находится вне диапазона 1-10, то программа должна вывести текст «ошибка».

x = int(input())
if x == 1:
    print('I')
elif x == 2:
    print('II')
elif x == 3:
    print('III')
elif x == 4:
    print('IV')
elif x == 5:
    print('V')
elif x == 6:
    print('VI')
elif x == 7:
    print('VII')
elif x == 8:
    print('VIII')
elif x == 9:
    print('IX')
elif x == 10:
    print('X')
else:
    print('ошибка')

# 65. Напишите программу, которая принимает на вход число и в зависимости от условий выводит текст «YES»,
#     либо «NO».
#     Условия:
#     •	если число нечётное, то вывести «YES»;
#     •	если число чётное в диапазоне от 2 до 5 (включительно), то вывести «NO»;
#     •	если число чётное в диапазоне от 6 до 20 (включительно), то вывести «YES»;
#     •	если число чётное и больше 20, то вывести «NO».

x = int(input())
if x % 2 != 0:
    print('YES')
elif x % 2 == 0 and 2 <= x <= 5:
    print('NO')
elif x % 2 == 0 and 6 <= x <= 20:
    print('YES')
elif x % 2 == 0 and x > 20:
    print('NO')

# 66. Даны две различные клетки шахматной доски. Напишите программу, которая определяет, может ли слон
#     попасть с первой клетки на вторую одним ходом. Программа получает на вход четыре числа от 1 до 8
#     каждое, задающие номер столбца и номер строки сначала для первой клетки, потом для второй клетки.
#     Программа должна вывести «YES», если из первой клетки ходом слона можно попасть во вторую или «NO» в
#     противном случае.
#     На вход программе подаётся четыре числа от 1 до 8. Программа должна вывести текст в соответствии с
#     условием задачи. Шахматный слон ходит по диагоналям.

a, b, c, d = int(input()), int(input()), int(input()), int(input())
if (a - c)**2 == (b - d)**2:
    print('YES')
else:
    print('NO')

# 67. Даны две различные клетки шахматной доски. Напишите программу,  которая определяет, может ли конь
#     попасть с первой клетки на вторую одним ходом. Программа получает на вход четыре числа от 1 до 8
#     каждое, задающие номер столбца и номер строки сначала для первой клетки, потом для второй клетки.
#     Программа должна вывести «YES», если из первой клетки ходом коня можно попасть во вторую или «NO» в
#     противном случае.
#     На вход программе подаётся четыре числа от 1 до 8. Программа должна вывести текст в соответствии с
#     условием задачи. Шахматный конь ходит буквой «Г».

a, b, c, d = int(input()), int(input()), int(input()), int(input())
if (a + b + c + d) % 2 == 1 and a != c and b != d:
    print('YES')
else:
    print('NO')

# 68. Даны две различные клетки шахматной доски. Напишите программу,  которая определяет, может ли ферзь
#     попасть с первой клетки на вторую одним ходом. Программа получает на вход четыре числа от 1 до 8
#     каждое, задающие номер столбца и номер строки сначала для первой клетки, потом для второй клетки.
#     Программа должна вывести «YES», если из первой клетки ходом ферзя можно попасть во вторую
#     или «NO» в противном случае.
#     На вход программе подаётся четыре числа от 1 до 8. Программа должна вывести текст в соответствии с
#     условием задачи. Шахматный ферзь ходит по диагонали, горизонтали или вертикали.

a, b, c, d = int(input()), int(input()), int(input()), int(input())
if (a != c and b == d) or (a == c and b != d) or (a - c)**2 == (b - d)**2:
    print('YES')
else:
    print('NO')