# 434. Импортируйте стандартный модуль os и выведите на экран значение переменной name из этого модуля.

print(__import__('os').name)

# 435. А вы знаете, что такое «Переменная окружения»? Почитайте самостоятельно, если не встречались.
#      Модуль os позволяет получить доступ ко всем переменным окружения, они хранятся в переменной environ. environ представляет собой по сути словарь переменных окружения, 
#      и нам интересно взглянуть на значение, которое хранится под ключом 'HOME', его необходимо вывести на экран.

print(__import__('os').environ['HOME'])

# 436. Импортируйте имя Template из модуля string, чтобы код ниже заработал.

from string import Template

values = {'one': 'Привет', 'copter': 'Квадракоптер'}

t = Template("""
Ну что, мои хорошие, всем $one
Это шаблонная строка
В нее можно вставлять значения по ключам
Хочу сюда вставлю слово $copter, хочу сюда $copter
""")

print(t.substitute(values))

# 437. Импортируйте стандартный модуль sys и при помощи функции getrecursionlimit узнайте лимит предела рекурсии. Его необходимо вывести на экран.

print(__import__('sys').getrecursionlimit())

# 438. Из модуля string импортируйте следующие переменные: 
#      ascii_lowercase - строка, содержащая английский буквы англ. алфавита в нижнем регистре
#      ascii_uppercase - строка, содержащая английский буквы англ. алфавита в верхнем регистре
#      punctuation - строка, содержащая символы пунктуации
#      Необходимо в отдельных строках вывести сперва все знаки пунктуации, затем заглавные символы и уже потом маленькие.

print(f"{__import__('string').punctuation}\n{__import__('string').ascii_uppercase}\n{__import__('string').ascii_lowercase}")