# 210. Допишите программу так, чтобы она печатала на экран список, содержащий последовательность чисел 0,1,2,3,4,5,6,7,8,9 ?

print(list(range(10)))

# 211. Какие параметры необходимо передать в функцию range, чтобы получилась последовательность чисел от 12 до 34 включительно ?

print(list(range(12, 35)))

# 212. Теперь давайте добавим шаг. Необходимо сформировать последовательность 25, 33, 41, 49, 57 .... , 169.

print(list(range(25, 170, 8)))

# 213. Нам осталось поработать с убывающими последовательностями. Сформируйте последовательность -11, -12, -13, -14 .... , -35.

print(list(range(-11, -36, -1)))

# 214. Еще одну. Сформируйте последовательность 10, 9, 8, 7, ... , 0.

print(list(range(10, -1, -1)))

# 215. И последняя последовательность 1000, 950, 900, 850, ... , 500.

print(list(range(1000, 450, -50)))