# 293. Тимур загадал число от 1 до n. За какое наименьшее количество вопросов (на которые Тимур отвечает "больше" или "меньше") Руслан может гарантированно угадать число Тимура?
#      На вход программе подается натуральное число n. Программа должна вывести наименьшее количество вопросов, которых гарантированно хватит Руслану, чтобы угадать число Тимура.

num = int(input())
x = 0
while num > 1:
    num = num / 2
    x += 1
print(x)

# 294. Магический шар 8

import random

answers = ['Бесспорно', 'Мне кажется - да', 'Пока не ясно, попробуй снова', 'Даже не думай', 
'Предрешено', 'Вероятнее всего', 'Спроси позже', 'Мой ответ - нет', 'Никаких сомнений', 
'Хорошие перспективы', 'Лучше не рассказывать', 'По моим данным - нет', 'Определённо да', 
'Знаки говорят - да', 'Сейчас нельзя предсказать', 'Перспективы не очень хорошие', 
'Можешь быть уверен в этом', 'Да', 'Сконцентрируйся и спроси опять', 'Весьма сомнительно']

print('Привет Мир, Я магический шар, и я знаю ответ на любой твой вопрос')

name = input('Как тебя зовут?')
print('Привет',  name)

again = 'y'

while again.lower() == 'y':
    question = input('Задай мне свой вопрос: ')
    print(random.choice(answers))
    again = input('Задать еще один вопрос? (y = да, n = нет): ')
    
    if not again.lower() == 'y':
        print('Возвращайся если возникнут вопросы!')

# 295. На вход программе подается натуральное число в десятичной системе счисления. Напишите программу, которая переводит его в двоичную, восьмеричную и шестнадцатеричную системы счисления.
#      На вход программе подается натуральное число. Программа должна вывести текст в соответствии с условием задачи.
#      Используйте встроенные функции bin(), oct(), hex(). Для шестнадцатеричной системы счисления используйте заглавные буквы A, B, C, D, E, F. BOH = Binary, Octal, Hex.

x = int(input())
print(bin(x)[2:])
print(oct(x)[2:])
print(hex(x)[2:].upper())