# 117. Скомпилируйте регулярное выражение, которое находит mac-адреса, и присвойте его переменной pattern. Мак-адрес - специальный идентификатор, который присваивается сетевому адаптеру.
#      Скомпилировать регулярное выражение, которое находит все mac-адреса: nn:nn:nn:nn:nn:nn, где n это 16-ричное число от 0 до F, и записать его в переменную pattern.
#      На вход программе подаётся 1 строка.
#      Ничего выводить не нужно. Нужно сохранить скомпилированное выражение в переменную.

import re

pattern = re.compile(r'(?:[A-F\d]{2}:){5}[A-F\d]{2}')

# 118. Найдите первое слово, которое содержится в определённом диапазоне.
#      Найти первое слово, состоящее из a-z в определённом диапазоне. Слово не может являться подпоследовательностью.
#      На вход программе подаётся 3 строки:
#      - Текст
#      - Начальная позиция для поиска
#      - Конечная позиция для поиска
#      Если в полученном диапазоне есть слово, то нужно его вывести.

import re

pattern = re.compile(r'\b\w+\b')
match = pattern.search(input(), int(input()), int(input()))
print(match.group() if match else '')