# 132. Дополните приведенный код так, чтобы он вывел сумму минимального и максимального ключа в словаре my_dict.

my_dict = {1.12: 'aa', 67.9: 45, 3.11: 'ccc', 7.9: 'dd', 9.2: 'ee', 7.1: 'ff', 0.12: 'qq', 1.91: 'aa', 10.12: [1, 2, 3], 99.0: {9, 0, 1}}
print(sum(min(my_dict) + max(my_dict)))

# 133. Дополните приведенный код, чтобы он вывел имена всех пользователей (в алфавитном порядке), чей номер оканчивается на 8.
#      Примечание. Имена необходимо вывести на одной строке, разделяя символом пробела.

users = [{'name': 'Todd', 'phone': '551-1414', 'email': 'todd@gmail.com'},
         {'name': 'Helga', 'phone': '555-1618', 'email': 'helga@mail.net'},
         {'name': 'Olivia', 'phone': '449-3141', 'email': ''},
         {'name': 'LJ', 'phone': '555-2718', 'email': 'lj@gmail.net'},
         {'name': 'Ruslan', 'phone': '422-145-9098', 'email': 'rus-lan.cha@yandex.ru'},
         {'name': 'John', 'phone': '233-421-32', 'email': ''},
         {'name': 'Lara', 'phone': '+7998-676-2532', 'email': 'g.lara89@gmail.com'},
         {'name': 'Alina', 'phone': '+7948-799-2434', 'email': 'ali.ch.b@gmail.com'},
         {'name': 'Robert', 'phone': '420-2011', 'email': ''},
         {'name': 'Riyad', 'phone': '128-8890-128', 'email': 'r.mahrez@mail.net'},
         {'name': 'Khabib', 'phone': '+7995-600-9080', 'email': 'kh.nurmag@gmail.com'},
         {'name': 'Olga', 'phone': '6449-314-1213', 'email': ''},
         {'name': 'Roman', 'phone': '+7459-145-8059', 'email': 'roma988@mail.ru'},
         {'name': 'Maria', 'phone': '12-129-3148', 'email': 'm.sharapova@gmail.com'},
         {'name': 'Fedor', 'phone': '+7445-341-0545', 'email': ''},
         {'name': 'Tim', 'phone': '242-449-3141', 'email': 'timm.ggg@yandex.ru'}]

tmp = [user['name'] for user in users if user['phone'].endswith('8')]
print(*sorted(tmp), end= ' ')

# 134. Дополните приведенный код, чтобы он вывел имена всех пользователей (в алфавитном порядке), у которых нет информации об электронной почте. 
#      Примечание 1. Ключ email может отсутствовать в словаре.
#      Примечание 2. Имена необходимо вывести на одной строке, разделяя символом пробела.

users = [{'name': 'Todd', 'phone': '551-1414', 'email': 'todd@gmail.com'},
         {'name': 'Helga', 'phone': '555-1618'},
         {'name': 'Olivia', 'phone': '449-3141', 'email': ''},
         {'name': 'LJ', 'phone': '555-2718', 'email': 'lj@gmail.net'},
         {'name': 'Ruslan', 'phone': '422-145-9098', 'email': 'rus-lan.cha@yandex.ru'},
         {'name': 'John', 'phone': '233-421-32', 'email': ''},
         {'name': 'Lara', 'phone': '+7998-676-2532', 'email': 'g.lara89@gmail.com'},
         {'name': 'Alina', 'phone': '+7948-799-2434'},
         {'name': 'Robert', 'phone': '420-2011', 'email': ''},
         {'name': 'Riyad', 'phone': '128-8890-128', 'email': 'r.mahrez@mail.net'},
         {'name': 'Khabib', 'phone': '+7995-600-9080', 'email': 'kh.nurmag@gmail.com'},
         {'name': 'Olga', 'phone': '6449-314-1213', 'email': ''},
         {'name': 'Roman', 'phone': '+7459-145-8059'},
         {'name': 'Maria', 'phone': '12-129-3148', 'email': 'm.sharapova@gmail.com'},
         {'name': 'Fedor', 'phone': '+7445-341-0545', 'email': ''},
         {'name': 'Tim', 'phone': '242-449-3141', 'email': 'timm.ggg@yandex.ru'}]

for user in sorted(users, key=lambda x: x['name']):
    if 'email' not in user or user['email'] == '':
        print(user['name'], end=' ')

# 135. Напишите программу, которая будет превращать натуральное число в строку, заменяя все цифры в числе на слова:
#      - 0 на zero;
#      - 1 на one;
#      - 2 на two;
#      - 3 на three;
#      - 4 на four;
#      - 5 на five;
#      - 6 на six;
#      - 7 на seven;
#      - 8 на eight;
#      - 9 на nine.
# 
#      Формат входных данных
#      На вход программе подается натуральное число.
# 
#      Формат выходных данных
#      Программа должна вывести строковое представление числа.
# 
#      Примечание. Используйте словарь вместо условного оператора.

digits = {
    0: "zero",
    1: "one",
    2: "two",
    3: "three",
    4: "four",
    5: "five",
    6: "six",
    7: "seven",
    8: "eight",
    9: "nine"
}
print(*[digits[int(i)] for i in input()], end=' ')

# 136. Напишите программу, которая по номеру курса выводит информацию о данном курсе. 
# 
#      Номер курса (ключ)	Номер аудитории (значение)	Преподаватель (значение)	Время (значение)
#           CS101	                3004	                   Хайнс	                8:00
#           CS102	                4501	                   Альварадо	            9:00
#           CS103	                6755	                   Рич	                    10:00
#           NT110	                1244	                   Берк	                    11:00
#           CM241	                1411	                   Ли	                    13:00
# 
#      Формат входных данных
#      На вход программе подается одна строка – номер курса.
# 
#      Формат выходных данных
#      Программа должна вывести номер курса, затем номер аудитории, имя преподавателя и время проведения курса в соответствии с примерами.
# 
#      Примечание 1. Используйте словарь вместо условного оператора.
#      Примечание 2. Для удобного вывода используйте строковый метод format() или f-строки.

courses = {
    'CS101': ['3004', 'Хайнс', '8:00'],
    'CS102': ['4501', 'Альварадо', '9:00'],
    'CS103': ['6755', 'Рич', '10:00'],
    'NT110': ['1244', 'Берк', '11:00'],
    'CM241': ['1411', 'Ли', '13:00']
}
n = input()
print(f'{n}: {courses[n][0]}, {courses[n][1]}, {courses[n][2]}')

# 137. На мобильных кнопочных телефонах текстовые сообщения можно отправлять с помощью цифровой клавиатуры. 
#      Поскольку с каждой клавишей связано несколько букв, для большинства букв требуется несколько нажатий клавиш. 
#      При однократном нажатии цифры генерируется первый символ, указанный для этой клавиши. 
#      Нажатие цифры 2,3,4 или 5 раз генерирует второй, третий, четвертый или пятый символ клавиши.
# 
#      1	.,?!:
#      2	ABC
#      3	DEF
#      4	GHI
#      5	JKL
#      6	MNO
#      7	PQRS
#      8	TUV
#      9	WXYZ
#      0	space (пробел)
#      Напишите программу, которая отображает нажатия клавиш, необходимые для введенного сообщения.
# 
#      Формат входных данных
#      На вход программе подается одна строка – текстовое сообщение.
# 
#      Формат выходных данных
#      Программа должна вывести нажатия клавиш, необходимых для введенного сообщения.
# 
#      Примечание 1. Ваша программа должна обрабатывать как прописные, так и строчные буквы.
#      Примечание 2. Ваша программа должна игнорировать любые символы, не указанные в приведенной выше таблице.
#      Примечание 3. Nokia 3310, чтобы вспомнить, как это было 😄

digits = {
    '1': ['.', ',', '?', '!', ':'],
    '2': ['A', 'B', 'C'],
    '3': ['D', 'E', 'F'],
    '4': ['G', 'H', 'I'],
    '5': ['J', 'K', 'L'],
    '6': ['M', 'N', 'O'],
    '7': ['P', 'Q', 'R', 'S'],
    '8': ['T', 'U', 'V'],
    '9': ['W', 'X', 'Y', 'Z'],
    '0': [' ']
}
word = input().upper()
for c in word:
    for k, v in digits.items():
        if c in v:
            print(k * (v.index(c) + 1), end='')

# 138. Код Морзе для представления цифр и букв использует тире и точки. Напишите программу для кодирования текстового сообщения в соответствии с кодом Морзе.
#      Символ	Код	Символ	Код	Символ	Код	Символ	Код
#        A	    .-	  J	    .---   S	...	  1	    .----
#        B	    -...  K	    -.-	   T	 -	  2	    ..---
#        C	    -.-.  L	    .-..   U	..-	  3	    ...--
#        D	    -..	  M	    --	   V	...-  4	    ....-
#        E	    .	  N	    -.	   W	.--	  5	    .....
#        F	    ..-.  O	    ---	   X	-..-  6	    -....
#        G	    --.	  P	    .--.   Y	-.--  7	    --...
#        H	    ....  Q	    --.-   Z	--..  8	    ---..
#        I	    ..	  R	    .-.	   0	----- 9	    ----.
# 
#      Формат входных данных
#      На вход программе подается одна строка – текстовое сообщение.
# 
#      Формат выходных данных
#      Программа должна вывести закодированное с помощью кода Морзе сообщение, оставляя пробел между каждым закодированным символом (последовательностью тире и точек).
# 
#      Примечание 1. Ваша программа должна игнорировать любые символы, не перечисленные в таблице.
#      Примечание 2. Код Морзе был разработан в XIX веке и все еще используется, спустя более 160 лет после создания.

letters = [c for c in 'ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789']
morse = ['.-', '-...', '-.-.', '-..', '.', '..-.', '--.', '....', '..', '.---', '-.-', '.-..', '--', '-.', '---', '.--.', '--.-', '.-.', '...', '-', '..-', '...-', '.--', '-..-', '-.--', '--..', '-----', '.----', '..---', '...--', '....-', '.....', '-....', '--...', '---..', '----.']
word = input().upper()
for c in word:
    for i, j in zip(letters, morse):
        if c == i:
            print(j, end=' ')

# 139. Дополните приведенный код, чтобы в переменной result хранился словарь, в котором ключи – числа от 1 до 15 (включительно), а значения представляют собой квадраты ключей.
#      Примечание. Выводить содержимое словаря result не нужно.

result = {i: i**2 for i in range(1, 16)}

# 140. Дополните приведенный код так, чтобы он объединил содержимое двух словарей dict1 и dict2: если ключ есть в обоих словарях, 
#      добавьте его в результирующий словарь со значением, равным сумме соответствующих значений из первого и второго словаря; 
#      если ключ есть только в одном из словарей, добавьте его в результирующий словарь с его текущим значением. 
#      Результирующий словарь необходимо присвоить переменной result.
# 
#      Примечание. Выводить содержимое словаря result не нужно.

dict1 = {'a': 100, 'z': 333, 'b': 200, 'c': 300, 'd': 45, 'e': 98, 't': 76, 'q': 34, 'f': 90, 'm': 230}
dict2 = {'a': 300, 'b': 200, 'd': 400, 't': 777, 'c': 12, 'p': 123, 'w': 111, 'z': 666}

result = dict1.copy()
for k, v in dict2.items():
    if k in dict1:
        result[k] += dict2[k]
    else:
        result[k] = dict2[k]

# 141. Дополните приведенный код так, чтобы в переменной result хранился словарь, в котором для каждого символа строки text будет подсчитано количество его вхождений.
#      Примечание. Выводить содержимое словаря result не нужно.

text = 'footballcyberpunkextraterritorialityconversationalistblockophthalmoscopicinterdependencemamauserfff'

result = {c: text.count(c) for c in text}

# 142. Дополните приведенный код, чтобы он вывел наиболее часто встречающееся слово строки s. 
#      Если таких слов несколько, должно быть выведено то, что меньше в лексикографическом порядке.

s = 'orange strawberry barley gooseberry apple apricot barley currant orange melon pomegranate banana banana orange barley apricot plum grapefruit banana quince strawberry barley grapefruit banana grapes melon strawberry apricot currant currant gooseberry raspberry apricot currant orange lime quince grapefruit barley banana melon pomegranate barley banana orange barley apricot plum banana quince lime grapefruit strawberry gooseberry apple barley apricot currant orange melon pomegranate banana banana orange apricot barley plum banana grapefruit banana quince currant orange melon pomegranate barley plum banana quince barley lime grapefruit pomegranate barley'
result = {s.count(c): c for c in sorted(s.split(), reverse=True)}
print(result[max(result)])

# 143. Вам доступен список pets, содержащий информацию о собаках и их владельцах.  
#      Каждый элемент списка – это кортеж вида (кличка собаки, имя владельца, фамилия владельца, возраст владельца).
#      Дополните приведенный код так, чтобы в переменной result хранился словарь, в котором для каждого владельца будут перечислены его собаки. 
#      Ключом словаря должен быть кортеж (имя, фамилия, возраст владельца), а значением – список кличек собак (сохранив исходный порядок следования).
# 
#      Примечание 1. Не забывайте: кортежи являются неизменяемыми, поэтому могут быть ключами словаря.
#      Примечание 2. Обратите внимание, что у некоторых владельцев по несколько собак.
#      Примечание 3. Выводить содержимое словаря result не нужно.
#      Примечание 4. После решения задачи обязательно загляните на форум решений. Там закреплены и подробно объяснены различные способы решения этой задачи😇.

pets = [('Hatiko', 'Parker', 'Wilson', 50),
        ('Rusty', 'Josh', 'King', 25),
        ('Fido', 'John', 'Smith', 28),
        ('Butch', 'Jake', 'Smirnoff', 18),
        ('Odi', 'Emma', 'Wright', 18),
        ('Balto', 'Josh', 'King', 25),
        ('Barry', 'Josh', 'King', 25),
        ('Snape', 'Hannah', 'Taylor', 40),
        ('Horry', 'Martha', 'Robinson', 73),
        ('Giro', 'Alex', 'Martinez', 65),
        ('Zooma', 'Simon', 'Nevel', 32),
        ('Lassie', 'Josh', 'King', 25),
        ('Chase', 'Martha', 'Robinson', 73),
        ('Ace', 'Martha', 'Williams', 38),
        ('Rocky', 'Simon', 'Nevel', 32)]

result = {}
for i in pets:
    result.setdefault((i[1], i[2], i[3]), []).append(i[0])

# 144. На вход программе подается строка текста. Напишите программу, которая выводит слово, которое встречается реже всего, без учета регистра. 
#      Если таких слов несколько, выведите то, которое меньше в лексикографическом порядке.
# 
#      Формат входных данных
#      На вход программе подается строка текста.
# 
#      Формат выходных данных
#      Программа должна вывести слово (в нижнем регистре), встречаемое реже всего.
# 
#      Примечание 1. Программа не должна быть чувствительной к регистру, слова apple и Apple должна воспринимать как одинаковые.
#      Примечание 2. Слово — последовательность букв. Кроме слов в тексте могут присутствовать пробелы и знаки препинания .,!?:;-, которые нужно игнорировать. 
#      Других символов в тексте нет.

s = sorted(__import__('re').sub(r'[.,!?:;-]', '', input().lower()).split())
result = {c: s.count(c) for c in s}
print(*sorted(result.items(), key=lambda x: x[1])[0][0], sep='')

# 145. На вход программе подается строка, содержащая строки-идентификаторы. Напишите программу, которая исправляет их так, чтобы в результирующей строке не было дубликатов. 
#      Для этого необходимо прибавлять к повторяющимся идентификаторам постфикс _n, где n – количество раз, сколько такой идентификатор уже встречался.
# 
#      Формат входных данных
#      На вход программе подается строка текста, содержащая строки-идентификаторы, разделенные символом пробела.
# 
#      Формат выходных данных
#      Программа должна вывести исправленную строку, не содержащую дубликатов сохранив при этом исходный порядок.

s = input().split()
result = []
count = {}

for c in s:
    if c not in result:
        result.append(c)
        count[c] = 0
    else:
        count[c] += 1
        result.append(f'{c}_{count[c]}')

print(*result)

# 146. Программисты, как вы уже знаете, постоянно учатся, а в общении между собой используют весьма специфический язык. 
#      Чтобы систематизировать ваш пополняющийся профессиональный лексикон, мы придумали эту задачу. 
#      Напишите программу создания небольшого словаря сленговых программерских выражений, чтобы она потом по запросу возвращала значения из этого словаря.
# 
#      Формат входных данных
#      В первой строке задано одно целое число n — количество слов в словаре. В следующих n строках записаны слова и их определения, разделенные двоеточием и символом пробела. 
#      В следующей строке записано целое число m — количество поисковых слов, чье определение нужно вывести. В следующих m строках записаны сами слова, по одному на строке.
# 
#      Формат выходных данных
#      Для каждого слова, независимо от регистра символов, если оно присутствует в словаре, необходимо вывести его определение. 
#      Если слова в словаре нет, программа должна вывести "Не найдено", без кавычек.
# 
#      Примечание 1. Мини-словарь для начинающих разработчиков можно посмотреть тут.
#      Примечание 2. Гарантируется, что в определяемом слове или фразе отсутствует двоеточие (:), следом за которым идёт пробел.

words = {}
for _ in range(int(input())):
    k, v = input().split(':')
    words[k.lower()] = v.strip(' ')
for _ in range(int(input())):
    print(words.get(input().lower(), 'Не найдено'))

# 147. Анаграмма – слово (словосочетание), образованное путём перестановки букв, составляющих другое слово (или словосочетание). 
#      Например, английские слова evil и live – это анаграммы. На вход программе подаются два слова. Напишите программу, которая определяет, являются ли они анаграммами.
# 
#      Формат входных данных
#      На вход программе подаются два слова, каждое на отдельной строке.
# 
#      Формат выходных данных
#      Программа должна вывести YES если слова являются анаграммами и NO в противном случае.

s1, s2 = input(), input()
d1, d2 = {c1: s1.count(c1) for c1 in s1}, {c2: s2.count(c2) for c2 in s2}
print(['NO', 'YES'][d1 == d2])

# 148. На вход программе подаются два предложения. Напишите программу, которая определяет, являются они анаграммами или нет. 
#      Ваша программа должна игнорировать регистр символов, знаки препинания и пробелы.
# 
#      Формат входных данных
#      На вход программе подаются два предложения, каждое на отдельной строке.
# 
#      Формат выходных данных
#      Программа должна вывести YES , если предложения – анаграммы и NO в противном случае.
# 
#      Примечание. Кроме слов в тексте могут присутствовать пробелы и знаки препинания .,!?:;-. Других символов в тексте нет.

s1, s2 = [__import__('re').sub(r'[.,!?:;-]', '', input().lower()).split() for _ in range(2)]
d1, d2 = {}, {}

for word in s1:
    for c in word:
        d1[c] = d1.get(c, 0) + 1
    
for word in s2:
    for c in word:
        d2[c] = d2.get(c, 0) + 1

print(['NO', 'YES'][d1 == d2])

# 149. Вам дан словарь, состоящий из пар слов-синонимов. Повторяющихся слов в словаре нет. Напишите программу, которая для одного данного слова определяет его синоним.
# 
#      Формат входных данных
#      На вход программе подается количество пар синонимов n. Далее следует n строк, каждая строка содержит два слова-синонима. 
#      После этого следует одно слово, синоним которого надо найти.
# 
#      Формат выходных данных
#      Программа должна вывести одно слово, синоним введенного.
# 
#      Примечание 1. Гарантируется, что синоним введенного слова существует в словаре.
#      Примечание 2. Все слова в словаре начинаются с заглавной буквы.

dct = {i[0]: i[1] for i in [input().split() for _ in range(int(input()))]}

x = input()
for k, v in dct.items():
    if x == k:
        print(dct[x])
    elif x == v:
        print(k)

# 150. На вход программе подается список стран и городов каждой страны. Затем даны названия городов. 
#      Напишите программу, которая для каждого города выводит, в какой стране он находится.
# 
#      Формат входных данных
#      Программа получает на вход количество стран n. Далее идет n строк, каждая строка начинается с названия страны, затем идут названия городов этой страны. 
#      В следующей строке записано число m, далее идут m запросов — названия каких-то m городов, из перечисленных выше.
# 
#      Формат выходных данных
#      Программа должна вывести название страны, в которой находится данный город в соответствии с примером.

dct = {i[0]: i[1:] for i in [input().split() for _ in range(int(input()))]}

for _ in range(int(input())):
    x = input()
    print(next(k for k, v in dct.items() if x in v))

# 151. Тимур записал телефоны всех своих друзей, чтобы автоматизировать поиск нужного номера.
#      У каждого из друзей Тимура может быть один или более телефонных номеров. Напишите программу, которая поможет Тимуру находить все номера определённого друга.
# 
#      Формат входных данных
#      В первой строке задано одно целое число n — количество номеров телефонов, информацию о которых Тимур сохранил в телефонной книге. 
#      В следующих n строках заданы телефоны и имена их владельцев через пробел. В следующей строке записано целое число m — количество поисковых запросов от Тимура. 
#      В следующих m строках записаны сами запросы, по одному на строке. Каждый запрос — это имя друга, чьи телефоны Тимур хочет найти.
# 
#      Формат выходных данных
#      Для каждого запроса от Тимура выведите в отдельной строке все телефоны, принадлежащие человеку с этим именем (независимо от регистра имени). 
#      Если в телефонной книге нет телефонов человека с таким именем, выведите в соответствующей строке «абонент не найден» (без кавычек).
# 
#      Примечание 1. Телефоны одного человека выводите в одну строку через пробел в том порядке, в каком они были заданы во входных данных.
#      Примечание 2. Количество строк в ответе должно быть равно числу m.
#      Примечание 3. Телефон — это несколько цифр, записанных подряд, а имя может состоять из букв русского или английского алфавита. Записи не повторяются.
