# 132. Дополните приведенный код так, чтобы он вывел сумму минимального и максимального ключа в словаре my_dict.

my_dict = {1.12: 'aa', 67.9: 45, 3.11: 'ccc', 7.9: 'dd', 9.2: 'ee', 7.1: 'ff', 0.12: 'qq', 1.91: 'aa', 10.12: [1, 2, 3], 99.0: {9, 0, 1}}
print(sum(min(my_dict) + max(my_dict)))

# 133. Дополните приведенный код, чтобы он вывел имена всех пользователей (в алфавитном порядке), чей номер оканчивается на 8.
#      Примечание. Имена необходимо вывести на одной строке, разделяя символом пробела.

users = [{'name': 'Todd', 'phone': '551-1414', 'email': 'todd@gmail.com'},
         {'name': 'Helga', 'phone': '555-1618', 'email': 'helga@mail.net'},
         {'name': 'Olivia', 'phone': '449-3141', 'email': ''},
         {'name': 'LJ', 'phone': '555-2718', 'email': 'lj@gmail.net'},
         {'name': 'Ruslan', 'phone': '422-145-9098', 'email': 'rus-lan.cha@yandex.ru'},
         {'name': 'John', 'phone': '233-421-32', 'email': ''},
         {'name': 'Lara', 'phone': '+7998-676-2532', 'email': 'g.lara89@gmail.com'},
         {'name': 'Alina', 'phone': '+7948-799-2434', 'email': 'ali.ch.b@gmail.com'},
         {'name': 'Robert', 'phone': '420-2011', 'email': ''},
         {'name': 'Riyad', 'phone': '128-8890-128', 'email': 'r.mahrez@mail.net'},
         {'name': 'Khabib', 'phone': '+7995-600-9080', 'email': 'kh.nurmag@gmail.com'},
         {'name': 'Olga', 'phone': '6449-314-1213', 'email': ''},
         {'name': 'Roman', 'phone': '+7459-145-8059', 'email': 'roma988@mail.ru'},
         {'name': 'Maria', 'phone': '12-129-3148', 'email': 'm.sharapova@gmail.com'},
         {'name': 'Fedor', 'phone': '+7445-341-0545', 'email': ''},
         {'name': 'Tim', 'phone': '242-449-3141', 'email': 'timm.ggg@yandex.ru'}]

tmp = [user['name'] for user in users if user['phone'].endswith('8')]
print(*sorted(tmp), end= ' ')

# 134. Дополните приведенный код, чтобы он вывел имена всех пользователей (в алфавитном порядке), у которых нет информации об электронной почте. 
#      Примечание 1. Ключ email может отсутствовать в словаре.
#      Примечание 2. Имена необходимо вывести на одной строке, разделяя символом пробела.

users = [{'name': 'Todd', 'phone': '551-1414', 'email': 'todd@gmail.com'},
         {'name': 'Helga', 'phone': '555-1618'},
         {'name': 'Olivia', 'phone': '449-3141', 'email': ''},
         {'name': 'LJ', 'phone': '555-2718', 'email': 'lj@gmail.net'},
         {'name': 'Ruslan', 'phone': '422-145-9098', 'email': 'rus-lan.cha@yandex.ru'},
         {'name': 'John', 'phone': '233-421-32', 'email': ''},
         {'name': 'Lara', 'phone': '+7998-676-2532', 'email': 'g.lara89@gmail.com'},
         {'name': 'Alina', 'phone': '+7948-799-2434'},
         {'name': 'Robert', 'phone': '420-2011', 'email': ''},
         {'name': 'Riyad', 'phone': '128-8890-128', 'email': 'r.mahrez@mail.net'},
         {'name': 'Khabib', 'phone': '+7995-600-9080', 'email': 'kh.nurmag@gmail.com'},
         {'name': 'Olga', 'phone': '6449-314-1213', 'email': ''},
         {'name': 'Roman', 'phone': '+7459-145-8059'},
         {'name': 'Maria', 'phone': '12-129-3148', 'email': 'm.sharapova@gmail.com'},
         {'name': 'Fedor', 'phone': '+7445-341-0545', 'email': ''},
         {'name': 'Tim', 'phone': '242-449-3141', 'email': 'timm.ggg@yandex.ru'}]

for user in sorted(users, key=lambda x: x['name']):
    if 'email' not in user or user['email'] == '':
        print(user['name'], end=' ')

# 135. Напишите программу, которая будет превращать натуральное число в строку, заменяя все цифры в числе на слова:
#      - 0 на zero;
#      - 1 на one;
#      - 2 на two;
#      - 3 на three;
#      - 4 на four;
#      - 5 на five;
#      - 6 на six;
#      - 7 на seven;
#      - 8 на eight;
#      - 9 на nine.
# 
#      Формат входных данных
#      На вход программе подается натуральное число.
# 
#      Формат выходных данных
#      Программа должна вывести строковое представление числа.
# 
#      Примечание. Используйте словарь вместо условного оператора.

digits = {
    0: "zero",
    1: "one",
    2: "two",
    3: "three",
    4: "four",
    5: "five",
    6: "six",
    7: "seven",
    8: "eight",
    9: "nine"
}
print(*[digits[int(i)] for i in input()], end=' ')

# 136. Напишите программу, которая по номеру курса выводит информацию о данном курсе. 
# 
#      Номер курса (ключ)	Номер аудитории (значение)	Преподаватель (значение)	Время (значение)
#           CS101	                3004	                   Хайнс	                8:00
#           CS102	                4501	                   Альварадо	            9:00
#           CS103	                6755	                   Рич	                    10:00
#           NT110	                1244	                   Берк	                    11:00
#           CM241	                1411	                   Ли	                    13:00
# 
#      Формат входных данных
#      На вход программе подается одна строка – номер курса.
# 
#      Формат выходных данных
#      Программа должна вывести номер курса, затем номер аудитории, имя преподавателя и время проведения курса в соответствии с примерами.
# 
#      Примечание 1. Используйте словарь вместо условного оператора.
#      Примечание 2. Для удобного вывода используйте строковый метод format() или f-строки.

courses = {
    'CS101': ['3004', 'Хайнс', '8:00'],
    'CS102': ['4501', 'Альварадо', '9:00'],
    'CS103': ['6755', 'Рич', '10:00'],
    'NT110': ['1244', 'Берк', '11:00'],
    'CM241': ['1411', 'Ли', '13:00']
}
n = input()
print(f'{n}: {courses[n][0]}, {courses[n][1]}, {courses[n][2]}')

# 137. На мобильных кнопочных телефонах текстовые сообщения можно отправлять с помощью цифровой клавиатуры. 
#      Поскольку с каждой клавишей связано несколько букв, для большинства букв требуется несколько нажатий клавиш. 
#      При однократном нажатии цифры генерируется первый символ, указанный для этой клавиши. 
#      Нажатие цифры 2,3,4 или 5 раз генерирует второй, третий, четвертый или пятый символ клавиши.
# 
#      1	.,?!:
#      2	ABC
#      3	DEF
#      4	GHI
#      5	JKL
#      6	MNO
#      7	PQRS
#      8	TUV
#      9	WXYZ
#      0	space (пробел)
#      Напишите программу, которая отображает нажатия клавиш, необходимые для введенного сообщения.
# 
#      Формат входных данных
#      На вход программе подается одна строка – текстовое сообщение.
# 
#      Формат выходных данных
#      Программа должна вывести нажатия клавиш, необходимых для введенного сообщения.
# 
#      Примечание 1. Ваша программа должна обрабатывать как прописные, так и строчные буквы.
#      Примечание 2. Ваша программа должна игнорировать любые символы, не указанные в приведенной выше таблице.
#      Примечание 3. Nokia 3310, чтобы вспомнить, как это было 😄

digits = {
    '1': ['.', ',', '?', '!', ':'],
    '2': ['A', 'B', 'C'],
    '3': ['D', 'E', 'F'],
    '4': ['G', 'H', 'I'],
    '5': ['J', 'K', 'L'],
    '6': ['M', 'N', 'O'],
    '7': ['P', 'Q', 'R', 'S'],
    '8': ['T', 'U', 'V'],
    '9': ['W', 'X', 'Y', 'Z'],
    '0': [' ']
}
word = input().upper()
for c in word:
    for k, v in digits.items():
        if c in v:
            print(k * (v.index(c) + 1), end='')

# 138. Код Морзе для представления цифр и букв использует тире и точки. Напишите программу для кодирования текстового сообщения в соответствии с кодом Морзе.
#      Символ	Код	Символ	Код	Символ	Код	Символ	Код
#        A	    .-	  J	    .---   S	...	  1	    .----
#        B	    -...  K	    -.-	   T	 -	  2	    ..---
#        C	    -.-.  L	    .-..   U	..-	  3	    ...--
#        D	    -..	  M	    --	   V	...-  4	    ....-
#        E	    .	  N	    -.	   W	.--	  5	    .....
#        F	    ..-.  O	    ---	   X	-..-  6	    -....
#        G	    --.	  P	    .--.   Y	-.--  7	    --...
#        H	    ....  Q	    --.-   Z	--..  8	    ---..
#        I	    ..	  R	    .-.	   0	----- 9	    ----.
# 
#      Формат входных данных
#      На вход программе подается одна строка – текстовое сообщение.
# 
#      Формат выходных данных
#      Программа должна вывести закодированное с помощью кода Морзе сообщение, оставляя пробел между каждым закодированным символом (последовательностью тире и точек).
# 
#      Примечание 1. Ваша программа должна игнорировать любые символы, не перечисленные в таблице.
#      Примечание 2. Код Морзе был разработан в XIX веке и все еще используется, спустя более 160 лет после создания.

letters = [c for c in 'ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789']
morse = ['.-', '-...', '-.-.', '-..', '.', '..-.', '--.', '....', '..', '.---', '-.-', '.-..', '--', '-.', '---', '.--.', '--.-', '.-.', '...', '-', '..-', '...-', '.--', '-..-', '-.--', '--..', '-----', '.----', '..---', '...--', '....-', '.....', '-....', '--...', '---..', '----.']
word = input().upper()
for c in word:
    for i, j in zip(letters, morse):
        if c == i:
            print(j, end=' ')

# 139. Дополните приведенный код, чтобы в переменной result хранился словарь, в котором ключи – числа от 1 до 15 (включительно), а значения представляют собой квадраты ключей.
#      Примечание. Выводить содержимое словаря result не нужно.

result = {i: i**2 for i in range(1, 16)}

# 140. Дополните приведенный код так, чтобы он объединил содержимое двух словарей dict1 и dict2: если ключ есть в обоих словарях, 
#      добавьте его в результирующий словарь со значением, равным сумме соответствующих значений из первого и второго словаря; 
#      если ключ есть только в одном из словарей, добавьте его в результирующий словарь с его текущим значением. 
#      Результирующий словарь необходимо присвоить переменной result.
# 
#      Примечание. Выводить содержимое словаря result не нужно.

dict1 = {'a': 100, 'z': 333, 'b': 200, 'c': 300, 'd': 45, 'e': 98, 't': 76, 'q': 34, 'f': 90, 'm': 230}
dict2 = {'a': 300, 'b': 200, 'd': 400, 't': 777, 'c': 12, 'p': 123, 'w': 111, 'z': 666}

result = dict1.copy()
for k, v in dict2.items():
    if k in dict1:
        result[k] += dict2[k]
    else:
        result[k] = dict2[k]

# 141. Дополните приведенный код так, чтобы в переменной result хранился словарь, в котором для каждого символа строки text будет подсчитано количество его вхождений.
#      Примечание. Выводить содержимое словаря result не нужно.

text = 'footballcyberpunkextraterritorialityconversationalistblockophthalmoscopicinterdependencemamauserfff'

result = {c: text.count(c) for c in text}

# 142. Дополните приведенный код, чтобы он вывел наиболее часто встречающееся слово строки s. 
#      Если таких слов несколько, должно быть выведено то, что меньше в лексикографическом порядке.

s = 'orange strawberry barley gooseberry apple apricot barley currant orange melon pomegranate banana banana orange barley apricot plum grapefruit banana quince strawberry barley grapefruit banana grapes melon strawberry apricot currant currant gooseberry raspberry apricot currant orange lime quince grapefruit barley banana melon pomegranate barley banana orange barley apricot plum banana quince lime grapefruit strawberry gooseberry apple barley apricot currant orange melon pomegranate banana banana orange apricot barley plum banana grapefruit banana quince currant orange melon pomegranate barley plum banana quince barley lime grapefruit pomegranate barley'
result = {s.count(c): c for c in sorted(s.split(), reverse=True)}
print(result[max(result)])

# 143. Вам доступен список pets, содержащий информацию о собаках и их владельцах.  
#      Каждый элемент списка – это кортеж вида (кличка собаки, имя владельца, фамилия владельца, возраст владельца).
#      Дополните приведенный код так, чтобы в переменной result хранился словарь, в котором для каждого владельца будут перечислены его собаки. 
#      Ключом словаря должен быть кортеж (имя, фамилия, возраст владельца), а значением – список кличек собак (сохранив исходный порядок следования).
# 
#      Примечание 1. Не забывайте: кортежи являются неизменяемыми, поэтому могут быть ключами словаря.
#      Примечание 2. Обратите внимание, что у некоторых владельцев по несколько собак.
#      Примечание 3. Выводить содержимое словаря result не нужно.
#      Примечание 4. После решения задачи обязательно загляните на форум решений. Там закреплены и подробно объяснены различные способы решения этой задачи😇.

pets = [('Hatiko', 'Parker', 'Wilson', 50),
        ('Rusty', 'Josh', 'King', 25),
        ('Fido', 'John', 'Smith', 28),
        ('Butch', 'Jake', 'Smirnoff', 18),
        ('Odi', 'Emma', 'Wright', 18),
        ('Balto', 'Josh', 'King', 25),
        ('Barry', 'Josh', 'King', 25),
        ('Snape', 'Hannah', 'Taylor', 40),
        ('Horry', 'Martha', 'Robinson', 73),
        ('Giro', 'Alex', 'Martinez', 65),
        ('Zooma', 'Simon', 'Nevel', 32),
        ('Lassie', 'Josh', 'King', 25),
        ('Chase', 'Martha', 'Robinson', 73),
        ('Ace', 'Martha', 'Williams', 38),
        ('Rocky', 'Simon', 'Nevel', 32)]

result = {}
for i in pets:
    result.setdefault((i[1], i[2], i[3]), []).append(i[0])

# 144. На вход программе подается строка текста. Напишите программу, которая выводит слово, которое встречается реже всего, без учета регистра. 
#      Если таких слов несколько, выведите то, которое меньше в лексикографическом порядке.
# 
#      Формат входных данных
#      На вход программе подается строка текста.
# 
#      Формат выходных данных
#      Программа должна вывести слово (в нижнем регистре), встречаемое реже всего.
# 
#      Примечание 1. Программа не должна быть чувствительной к регистру, слова apple и Apple должна воспринимать как одинаковые.
#      Примечание 2. Слово — последовательность букв. Кроме слов в тексте могут присутствовать пробелы и знаки препинания .,!?:;-, которые нужно игнорировать. 
#      Других символов в тексте нет.

s = sorted(__import__('re').sub(r'[.,!?:;-]', '', input().lower()).split())
result = {c: s.count(c) for c in s}
print(*sorted(result.items(), key=lambda x: x[1])[0][0], sep='')

# 145. На вход программе подается строка, содержащая строки-идентификаторы. Напишите программу, которая исправляет их так, чтобы в результирующей строке не было дубликатов. 
#      Для этого необходимо прибавлять к повторяющимся идентификаторам постфикс _n, где n – количество раз, сколько такой идентификатор уже встречался.
# 
#      Формат входных данных
#      На вход программе подается строка текста, содержащая строки-идентификаторы, разделенные символом пробела.
# 
#      Формат выходных данных
#      Программа должна вывести исправленную строку, не содержащую дубликатов сохранив при этом исходный порядок.

s = input().split()
result = []
count = {}

for c in s:
    if c not in result:
        result.append(c)
        count[c] = 0
    else:
        count[c] += 1
        result.append(f'{c}_{count[c]}')

print(*result)

# 146. Программисты, как вы уже знаете, постоянно учатся, а в общении между собой используют весьма специфический язык. 
#      Чтобы систематизировать ваш пополняющийся профессиональный лексикон, мы придумали эту задачу. 
#      Напишите программу создания небольшого словаря сленговых программерских выражений, чтобы она потом по запросу возвращала значения из этого словаря.
# 
#      Формат входных данных
#      В первой строке задано одно целое число n — количество слов в словаре. В следующих n строках записаны слова и их определения, разделенные двоеточием и символом пробела. 
#      В следующей строке записано целое число m — количество поисковых слов, чье определение нужно вывести. В следующих m строках записаны сами слова, по одному на строке.
# 
#      Формат выходных данных
#      Для каждого слова, независимо от регистра символов, если оно присутствует в словаре, необходимо вывести его определение. 
#      Если слова в словаре нет, программа должна вывести "Не найдено", без кавычек.
# 
#      Примечание 1. Мини-словарь для начинающих разработчиков можно посмотреть тут.
#      Примечание 2. Гарантируется, что в определяемом слове или фразе отсутствует двоеточие (:), следом за которым идёт пробел.

words = {}
for _ in range(int(input())):
    k, v = input().split(':')
    words[k.lower()] = v.strip(' ')
for _ in range(int(input())):
    print(words.get(input().lower(), 'Не найдено'))

# 147. Анаграмма – слово (словосочетание), образованное путём перестановки букв, составляющих другое слово (или словосочетание). 
#      Например, английские слова evil и live – это анаграммы. На вход программе подаются два слова. Напишите программу, которая определяет, являются ли они анаграммами.
# 
#      Формат входных данных
#      На вход программе подаются два слова, каждое на отдельной строке.
# 
#      Формат выходных данных
#      Программа должна вывести YES если слова являются анаграммами и NO в противном случае.

s1, s2 = input(), input()
d1, d2 = {c1: s1.count(c1) for c1 in s1}, {c2: s2.count(c2) for c2 in s2}
print(['NO', 'YES'][d1 == d2])

# 148. На вход программе подаются два предложения. Напишите программу, которая определяет, являются они анаграммами или нет. 
#      Ваша программа должна игнорировать регистр символов, знаки препинания и пробелы.
# 
#      Формат входных данных
#      На вход программе подаются два предложения, каждое на отдельной строке.
# 
#      Формат выходных данных
#      Программа должна вывести YES , если предложения – анаграммы и NO в противном случае.
# 
#      Примечание. Кроме слов в тексте могут присутствовать пробелы и знаки препинания .,!?:;-. Других символов в тексте нет.

s1, s2 = [__import__('re').sub(r'[.,!?:;-]', '', input().lower()).split() for _ in range(2)]
d1, d2 = {}, {}

for word in s1:
    for c in word:
        d1[c] = d1.get(c, 0) + 1
    
for word in s2:
    for c in word:
        d2[c] = d2.get(c, 0) + 1

print(['NO', 'YES'][d1 == d2])

# 149. Вам дан словарь, состоящий из пар слов-синонимов. Повторяющихся слов в словаре нет. Напишите программу, которая для одного данного слова определяет его синоним.
# 
#      Формат входных данных
#      На вход программе подается количество пар синонимов n. Далее следует n строк, каждая строка содержит два слова-синонима. 
#      После этого следует одно слово, синоним которого надо найти.
# 
#      Формат выходных данных
#      Программа должна вывести одно слово, синоним введенного.
# 
#      Примечание 1. Гарантируется, что синоним введенного слова существует в словаре.
#      Примечание 2. Все слова в словаре начинаются с заглавной буквы.

dct = {i[0]: i[1] for i in [input().split() for _ in range(int(input()))]}

x = input()
for k, v in dct.items():
    if x == k:
        print(dct[x])
    elif x == v:
        print(k)

# 150. На вход программе подается список стран и городов каждой страны. Затем даны названия городов. 
#      Напишите программу, которая для каждого города выводит, в какой стране он находится.
# 
#      Формат входных данных
#      Программа получает на вход количество стран n. Далее идет n строк, каждая строка начинается с названия страны, затем идут названия городов этой страны. 
#      В следующей строке записано число m, далее идут m запросов — названия каких-то m городов, из перечисленных выше.
# 
#      Формат выходных данных
#      Программа должна вывести название страны, в которой находится данный город в соответствии с примером.

dct = {i[0]: i[1:] for i in [input().split() for _ in range(int(input()))]}

for _ in range(int(input())):
    x = input()
    print(next(k for k, v in dct.items() if x in v))

# 151. Тимур записал телефоны всех своих друзей, чтобы автоматизировать поиск нужного номера.
#      У каждого из друзей Тимура может быть один или более телефонных номеров. Напишите программу, которая поможет Тимуру находить все номера определённого друга.
# 
#      Формат входных данных
#      В первой строке задано одно целое число n — количество номеров телефонов, информацию о которых Тимур сохранил в телефонной книге. 
#      В следующих n строках заданы телефоны и имена их владельцев через пробел. В следующей строке записано целое число m — количество поисковых запросов от Тимура. 
#      В следующих m строках записаны сами запросы, по одному на строке. Каждый запрос — это имя друга, чьи телефоны Тимур хочет найти.
# 
#      Формат выходных данных
#      Для каждого запроса от Тимура выведите в отдельной строке все телефоны, принадлежащие человеку с этим именем (независимо от регистра имени). 
#      Если в телефонной книге нет телефонов человека с таким именем, выведите в соответствующей строке «абонент не найден» (без кавычек).
# 
#      Примечание 1. Телефоны одного человека выводите в одну строку через пробел в том порядке, в каком они были заданы во входных данных.
#      Примечание 2. Количество строк в ответе должно быть равно числу m.
#      Примечание 3. Телефон — это несколько цифр, записанных подряд, а имя может состоять из букв русского или английского алфавита. Записи не повторяются.

phone_dct = {}

for _ in range(int(input())):
    phone, name = input().split()
    phone_dct.setdefault(name, []).append(phone)

for _ in range(int(input())):
    print(*phone_dct.get(input().capitalize(), ['абонент не найден']))

# 152. Напишите программу для расшифровки секретного слова методом частотного анализа.
# 
#      Формат входных данных
#      В первой строке задано зашифрованное слово. Во второй строке задано одно целое число n – количество букв в словаре. 
#      В следующих n строках записано, сколько раз конкретная буква алфавита встречается в этом слове – <буква>: <частота>.
# 
#      Формат выходных данных
#      Программа должна вывести дешифрованное слово.
# 
#      Примечание. Гарантируется, что частоты букв не повторяются.

s = input()
dct = {int(i[1]): i[0] for i in [input().split(': ') for _ in range(int(input()))]}
tmp = {i: s.count(i) for i in s}

for c in s:
    print(dct[tmp[c]], end='')

# 153. Дополните приведенный код, используя генератор, так чтобы получить словарь result , 
#      в котором ключом будет позиция числа в списке numbers (начиная с 0), а значением – его квадрат.
# 
#      Примечание. Выводить содержимое словаря result не нужно.

numbers = [34, 10, -4, 6, 10, 23, -90, 100, 21, -35, -95, 1, 36, -38, -19, 1, 6, 87]
result = {i: v ** 2 for i, v in enumerate(numbers)}

# 154. Дополните приведенный код, используя генератор, чтобы получить словарь result, состоящий из всех элементов словаря colors, кроме тех, у которых значением является None.
#      Примечание. Выводить содержимое словаря result не нужно.

colors = {'c1': 'Red', 'c2': 'Grey', 'c3': None, 'c4': 'Green', 'c5': 'Yellow', 'c6': 'Pink', 'c7': 'Orange', 'c8': None, 'c9': 'White', 'c10': 'Black', 'c11': 'Violet', 'c12': 'Gold', 'c13': None, 'c14': 'Amber', 'c15': 'Azure', 'c16': 'Beige', 'c17': 'Bronze', 'c18': None, 'c19': 'Lilac', 'c20': 'Pearl', 'c21': None, 'c22': 'Sand', 'c23': None}

result = {k: v for k, v in colors.items() if v is not None}

# 155. Дополните приведенный код, используя генератор, чтобы получить словарь result, состоящий из всех элементов словаря favorite_numbers , значения которых являются двузначными числами.
#      Примечание. Выводить содержимое словаря result не нужно.

favorite_numbers = {'timur': 17, 'ruslan': 7, 'larisa': 19, 'roman': 123, 'rebecca': 293, 'ronald': 76, 'dorothy': 62, 'harold': 36, 'matt': 314, 'kim': 451, 'rosaly': 18, 'rustam': 89, 'soltan': 111, 'amir': 654, 'dima': 390, 'amiran': 777, 'geor': 999, 'sveta': 75, 'rita': 909, 'kirill': 404, 'olga': 271, 'anna': 55, 'madlen': 876}

result = {k: v for k, v in favorite_numbers.items() if 9 < v < 100}

# 156. Дополните приведенный код, используя генератор, так, чтобы получить словарь result, состоящий из всех элементов словаря months , в которых ключ и значение поменялись местами.
#      Примечание. Выводить содержимое словаря result не нужно.

months = {1: 'January', 2: 'February', 3: 'March', 4: 'April', 5: 'May', 6: 'June', 7: 'July', 8: 'August', 9: 'September', 10: 'October', 11: 'November', 12: 'December'}

result = {v: k for k, v in months.items()}

# 157. В переменной s хранится строка пар число:слово. Дополните приведенный код, используя генератор, чтобы получить словарь result , в котором числа будут ключами, а слова – значениями.
#      Примечание 1. Ключи словаря должны быть целыми числами (иметь тип int), значения – строками (иметь тип str).
#      Примечание 2. Выводить содержимое словаря result не нужно.

s = '1:men 2:kind 90:number 0:sun 34:book 56:mountain 87:wood 54:car 3:island 88:power 7:box 17:star 101:ice'

result = {int(k[0]): k[1] for k in [[j for j in i.split(':')] for i in s.split()]}

# 158. Используя генератор, дополните приведенный код, чтобы получить словарь result , где ключом будет элемент списка numbers, а значением – отсортированный по возрастанию список всех его делителей начиная с 1.
#      Примечание 1. Если бы список numbers имел вид: numbers = [1, 6, 18], то результатом был бы словарь: result = {1: [1], 6: [1, 2, 3, 6], 18: [1, 2, 3, 6, 9, 18]}
#      Примечание 2. Выводить содержимое словаря result не нужно. 

numbers = [34, 10, 4, 6, 10, 23, 90, 100, 21, 35, 95, 1, 36, 38, 19, 1, 6, 87, 1000, 13456, 360]

result = {number: [i for i in range(1, number + 1) if not number % i] for number in numbers}

# 159. Дополните приведенный код, используя генератор, так, чтобы получить словарь result , в котором ключом будет строка – элемент списка words, а значением – список соответствующих кодов ASCII символов данной строки.
#      Примечание 1. Если бы список words имел вид: words = ['yes', 'hello'], то результатом был бы словарь: result = {'yes': [121, 101, 115], 'hello': [104, 101, 108, 108, 111]}
#      Примечание 2. Для получения ASCII кода символа используйте функцию ord().
#      Примечание 3. Выводить содержимое словаря result не нужно.

words = ['hello', 'bye', 'yes', 'no', 'python', 'apple', 'maybe', 'stepik', 'beegeek']

result = {word: [ord(char) for char in word] for word in words}

# 160. Дополните приведенный код, используя генератор, чтобы получить словарь result, состоящий из всех элементов словаря letters , за исключением тех, ключи которых есть в списке remove_keys.
#      Примечание. Выводить содержимое словаря result не нужно.

letters = {0: 'A', 1: 'B', 2: 'C', 3: 'D', 4: 'E', 5: 'F', 6: 'G', 7: 'H', 8: 'I', 9: 'J', 10: 'K', 11: 'L', 12: 'M', 13: 'N', 14: 'O', 15: 'P', 16: 'Q', 17: 'R', 18: 'S', 19: 'T', 20: 'U', 21: 'V', 22: 'W', 23: 'X', 24: 'Y', 26: 'Z'}

remove_keys = [1, 5, 7, 12, 17, 19, 21, 24]

result = {k: v for k, v in letters.items() if k not in remove_keys}

# 161. В переменной students хранится словарь, содержащий информацию о росте (в см) и массе (в кг) студентов.
#      Дополните приведенный код, используя генератор, чтобы получить словарь result, состоящий из всех элементов словаря students , где указан рост больше 167 см, а масса меньше 75 кг.
#      Примечание. Выводить содержимое словаря result не нужно.

students = {'Timur': (170, 75), 'Ruslan': (180, 105), 'Soltan': (192, 68), 'Roman': (175, 70), 'Madlen': (160, 50), 'Stefani': (165, 70), 'Tom': (190, 90), 'Jerry': (180, 87), 'Anna': (172, 67), 'Scott': (168, 78), 'John': (186, 79), 'Alex': (195, 120), 'Max': (200, 110), 'Barak': (180, 89), 'Donald': (170, 80), 'Rustam': (186, 100), 'Alice': (159, 59), 'Rita': (170, 80), 'Mary': (175, 69), 'Jane': (190, 80)}

result = {k: v for k, v in students.items() if v[0] > 167 and v[1] < 75}

# 162. Список tuples содержит кортежи, состоящие из трех чисел.
#      Дополните приведенный код, используя генератор, чтобы получить словарь result, в котором ключом является первый элемент каждого кортежа, а значением – кортеж из оставшихся двух элементов.
#      Примечание. Выводить содержимое словаря result не нужно.

tuples = [(1, 2, 3), (4, 5, 6), (7, 8, 9), (10, 11, 12), (13, 14, 15), (16, 17, 18), (19, 20, 21), (22, 23, 24), (25, 26, 27), (28, 29, 30), (31, 32, 33), (34, 35, 36)]

result = {k: (v, z) for k, v, z in tuples}

# 163. Даны три списка student_ids, student_names, student_grades, содержащие информацию о студентах.
#      Дополните приведенный код, используя генератор, так чтобы получить список result, содержащий вложенные словари в соответствии с образцом: [{'S001': {'Camila Rodriguez': 86}}, {'S002': {'Juan Cruz': 98}},...].
#      Примечание 1. Для параллельной итерации по всем трем спискам одновременно можно использовать встроенную функцию zip().
#      Примечание 2. Выводить содержимое списка result не нужно.

student_ids = ['S001', 'S002', 'S003', 'S004', 'S005', 'S006', 'S007', 'S008', 'S009', 'S010', 'S011', 'S012', 'S013'] 
student_names = ['Camila Rodriguez', 'Juan Cruz', 'Dan Richards', 'Sam Boyle', 'Batista Cesare', 'Francesco Totti', 'Khalid Hussain', 'Ethan Hawke', 'David Bowman', 'James Milner', 'Michael Owen', 'Gary Oldman', 'Tom Hardy'] 
student_grades = [86, 98, 89, 92, 45, 67, 89, 90, 100, 98, 10, 96, 93]

result = [{i[0]: {i[1]: i[2]}} for i in zip(student_ids, student_names, student_grades)]

# 164. Дополните приведенный код, чтобы в списках значений элементов словаря my_dict  не было чисел, больших 20. При этом порядок оставшихся элементов меняться не должен.
#      Примечание. Необходимо изменить словарь my_dict, выводить ничего не надо.

my_dict = {'C1': [10, 20, 30, 7, 6, 23, 90], 'C2': [20, 30, 40, 1, 2, 3, 90, 12], 'C3': [12, 34, 20, 21], 'C4': [22, 54, 209, 21, 7], 'C5': [2, 4, 29, 21, 19], 'C6': [4, 6, 7, 10, 55], 'C7': [4, 8, 12, 23, 42], 'C8': [3, 14, 15, 26, 48], 'C9': [2, 7, 18, 28, 18, 28]}

for k, v in my_dict.items():
    v = [i for i in v if i < 21]
    my_dict[k] = v

# 165. Словарь emails содержит информацию об электронных адресах пользователей, сгруппированных по домену. 
#      Дополните приведенный код, чтобы он вывел все электронные адреса в алфавитном порядке, каждый на отдельной строке, в формате username@domain.
# 
#      Примечание 1. Для сортировки в алфавитном порядке используйте встроенную функцию sorted(), либо списочный метод sort().
#      Примечание 2. Группировать электронные адреса по доменам не нужно.

emails = {'nosu.edu': ['timyr', 'joseph', 'svetlana.gaeva', 'larisa.mamuk'], 
          'gmail.com': ['ruslan.chaika', 'rustam.mini', 'stepik-best'], 
          'msu.edu': ['apple.fruit', 'beegeek', 'beegeek.school'], 
          'yandex.ru': ['surface', 'google'],
          'hse.edu': ['tomas-henders', 'cream.soda', 'zivert'],
          'mail.ru': ['angel.down', 'joanne', 'the.fame.moster']}

print(*sorted([f'{i}@{k}' for k, v in emails.items() for i in v]), sep='\n')

# 166. Как известно из курса биологии ДНК и РНК – последовательности нуклеотидов.
#      Четыре нуклеотида в ДНК:
#      - аденин (A);
#      - цитозин (C);
#      - гуанин (G);
#      - тимин (T).
#      Четыре нуклеотида в РНК:
#      - аденин (A);
#      - цитозин (C);
#      - гуанин (G);
#      - урацил (U).
#      Цепь РНК строится на основе цепи ДНК последовательным присоединением комплементарных нуклеотидов:
#      G → C; C → G; T → A; A → U.
#      Напишите программу, переводящую цепь ДНК в цепь РНК.
# 
#      Формат входных данных
#      На вход программе подается корректная цепь ДНК в верхнем регистре.
# 
#      Формат выходных данных
#      Программа должна вывести соответствующую цепь РНК в верхнем регистре.
# 
#      Примечание. Подробнее прочитать про ДНК и РНК можно тут и тут.

dnk = {'G': 'C', 'C': 'G', 'T': 'A', 'A': 'U'}
print(*[dnk.get(i) for i in input()], sep='')

# 167. Дана строка текста на русском языке, состоящая из слов и символов пробела. Словом считается последовательность букв, слова разделены одним пробелом или несколькими.
#      Напишите программу, определяющую для каждого слова порядковый номер его вхождения в текст именно в этой форме, с учетом регистра. 
#      Для первого вхождения слова программа выведет 1, для второго вхождения того же слова — 2 и т. д.
# 
#      Формат входных данных
#      Программа получает на вход единственную строку текста, состоящую только из русских букв и символов пробела. 
# 
#      Формат выходных данных
#      Для каждого слова исходного текста программа выводит одно целое число — номер вхождения этого слова в текст. Числа необходимо вывести на одной строке через пробел.
# 
#      Примечание. Количество чисел должно совпадать с количеством слов исходного текста.

tmp = {}
for i in input().split():
    tmp[i] = tmp.get(i, 0) + 1
    print(tmp[i], end=' ')

# 168. В игре Scrabble каждая буква приносит определенное количество баллов. Общая стоимость слова – сумма баллов его букв. Чем реже буква встречается, тем больше она ценится:
#      Баллы	Буква
#        1        A, E, I, L, N, O, R, S, T, U
#        2        D, G
#        3        B, C, M, P
#        4        F, H, V, W, Y
#        5        K
#        8        J, X
#        10       Q, Z
#      Напишите программу подсчета итоговой стоимости введенного слова.
# 
#      Формат входных данных
#      На вход программе подается одно слово в верхнем регистре на английском языке.
# 
#      Формат выходных данных
#      Программа должна вывести суммарную стоимость букв введеного слова.
# 
#      Примечание. Подробнее про игру можно почитать тут.

d = {
    1: 'AEILNORSTU',
    2: 'DG',
    3: 'BCMP',
    4: 'FHVWY',
    5: 'K',
    8: 'JX',
    10: 'QZ'
}
print(sum([k for c in input() for k, v in d.items() if c in v]))

# 169. Строка запроса (query string) — часть URL адреса, содержащая ключи и их значения. Она начинается после вопросительного знака и идет до конца адреса. Например:
#      https://beegeek.ru?name=timur                 # строка запроса: name=timur
#      Если параметров в строке запроса несколько, то они отделяются символом амперсанда &:
#      https://beegeek.ru?name=timur&color=green     # строка запроса: name=timur&color=green 
#      Напишите функцию build_query_string(), которая принимает на вход словарь с параметрами и возвращает строку запроса, сформированную из этих параметров.
# 
#      Примечание 1. В итоговой строке параметры должны быть отсортированы в лексикографическом порядке ключей словаря.
#      Примечание 2. Следующий программный код:
#      print(build_query_string({'name': 'timur', 'age': 28}))
#      print(build_query_string({'sport': 'hockey', 'game': 2, 'time': 17}))
#      должен выводить:
#      age=28&name=timur
#      game=2&sport=hockey&time=17
#      Примечание 3. Вызывать функцию build_query_string() не нужно, требуется только реализовать. 

def build_query_string(params):
    x = [f'{k}={v}' for k, v in sorted(params.items())]
    return '&'.join(x)

# 170. Напишите функцию merge(), объединяющую словари в один общий. Функция должна принимать список словарей и возвращать словарь, 
#      каждый ключ которого содержит множество (тип данных set) уникальных значений собранных из всех словарей переданного списка.
# 
#      Примечание 1. Следующий программный код:
#      result = merge([{'a': 1, 'b': 2}, {'b': 10, 'c': 100}, {'a': 1, 'b': 17, 'c': 50}, {'a': 5, 'd': 777}])
#      создает словарь:
#      result = {'a': {1, 5}, 'b': {2, 10, 17}, 'c': {50, 100}, 'd': {777}}
# 
#      Примечание 2. Вызывать функцию merge() не нужно, требуется только реализовать. 
#      Примечание 3. Слияние пустых словарей должно быть пустым словарем.

def merge(values):
    d = {}
    for i in values:
        for k, v in i.items():
            d.setdefault(k, set()).add(v)
    return d

# 171. В файловую систему компьютера, на котором развернута наша ❤️ платформа Stepik, проник опасный вирус и сломал контроль прав доступа к файлам. Говорят, вирус написал один из студентов курса Python для начинающих.
#      Для каждого файла известно, с какими действиями можно к нему обращаться:
#      - запись W (write, доступ на запись в файл);
#      - чтение R (read, доступ на чтение из файла);
#      - запуск X (execute, запуск на исполнение файла).
#      Напишите программу для восстановления контроля прав доступа к файлам. Ваша программа для каждого запроса должна будет возвращать OK если выполняется допустимая операция, и Access denied, если операция недопустима.
# 
#      Формат входных данных
#      Программа получает на вход количество файлов n, содержащихся в файловой системе компьютера. Далее идет n строк, на каждой имя файла и допустимые с ним операции, разделенные символом пробела. 
#      В следующей строке записано число m — количество запросов к файлам, и затем m строк с запросами вида операция файл. Одному и тому же файлу может быть адресовано любое количество запросов.
# 
#      Формат выходных данных
#      Программа должна вывести для каждого из m запросов в отдельной строке Access denied или OK.

r = {'write': 'W', 'read': 'R', 'execute': 'X'}
d = {}

for _ in range(int(input())):
    k, *v = input().split()
    d.setdefault(k, v)
    
for i in range(int(input())):
    x, y = input().split()
    if r[x] in d[y]:
        print('OK')
    else:
        print('Access denied')

# 172. Напишите программу для подсчета количества единиц каждого вида товара из приобретенных каждым покупателем интернет-магазина.
# 
#      Формат входных данных
#      На вход программе подается число n — количество строк в базе данных о продажах интернет-магазина. 
#      Далее следует n строк с записями вида покупатель товар количество, где покупатель — имя покупателя (строка без пробелов), товар — название товара (строка без пробелов), 
#      количество — количество приобретенных единиц товара (натуральное число).
# 
#      Формат выходных данных
#      Программа должна вывести список всех покупателей в лексикографическом порядке, после имени каждого покупателя — двоеточие, 
#      затем список названий всех приобретенных им товаров в лексикографическом порядке, после названия каждого товара — количество единиц товара. Информация о каждом товаре выводится на отдельной строке.
# 
#      Примечание. Обратите внимание на второй тест. Если позиции товаров повторяются, то в итоговый список попадает суммарное количество товара по данной позиции.

d = {}

for _ in range(int(input())):
    name, goods, count = input().split()
    d.setdefault(name, {}).setdefault(goods, []).append(int(count))

for k, v in sorted(d.items()):
    print(f'{k}:')
    for i, j in sorted(v.items()):
        print(i, sum(j))