# 1. Давайте попробуем написать нашу первую программу
#    Давайте выведем на экран при помощи команды print сообщение "Hello, Artem"
#    P.s. Не забывайте про апострофы

print("Hello, Artem")

# 2. Напишите программу, которая принимает на вход возраст человека (количество полных лет) и выводит сколько лет ему исполнится в следующем году

print(int(input()) + 1)

# 3. Вашей программе поступает на вход натуральное число. Ваша задача вывести в отдельных строках:
#    число, увеличенное в 2 раза;
#    число, уменьшенное в 2 раза

print((number := int(input())) * 2, number / 2, sep='\n')

# 4. Я думаю каждый знаком с квадратом - идеально симметричная и ровная фигура. Давайте напишем программу, которая вычисляет площадь квадрата по введенной длине.
#    На вход программе поступает вещественное число a
#    Программа выводит площадь квадрата

print(a := float(input()) ** 2)

# 5. Напишите программу, которая принимает на вход два целых числа в отдельных строках и выводит на экран их сумму.

a, b = int(input()), int(input())
print(a + b)

# 6. В этом задании необходимо написать программу, которая вычисляет площадь и периметр прямоугольника по введенной длине и ширине.
#    На вход программе в отдельных строках поступают два вещественных числа a и b: длина и ширина прямоугольника.
#    Программа должна вывести через пробел два значения: сперва площадь S, а затем периметр P прямоугольника

a, b = float(input()), float(input())
print(a * b, 2 * (a + b))

# 7. Дано значение температуры в градусах Фаренгейта. Определить значение этой же температуры в градусах Цельсия.
#    На вход программе поступает вещественное число F  - температура в градусах по Фаренгейту
#    Программа выводит градусы Цельсия

print((F := float(input()) - 32) * 5 / 9)

# 8. Найдите результат выражения ∣a∣+∣b∣
#    Значения переменных а и b поступают на вход в отдельных строках и могут быть только целого типа

a, b = abs(int(input())), abs(int(input()))
print(a + b)

# 9. Напишите программу, которая вычисляет длину отрезка (т.е. расстояние между двумя точками), заданного двумя значениями x1 и x2 (вещественные числа).

print(abs(float(input()) - float(input())))

# 10. Вводится вещественное число и нам нужно его округлить до 2 и 3 разряда после запятой и вывести полученный результат через пробел в одной строчке

print(round(x := float(input()), 2), round(x, 3))

# 11. Даны значения двух моментов времени, принадлежащих одним и тем же суткам: часы, минуты и секунды для каждого из моментов времени. 
#     Известно, что второй момент времени наступил не раньше первого. Определите, сколько секунд прошло между двумя моментами времени.
#     Программа на вход получает три целых числа: часы, минуты, секунды, задающие первый момент времени и три целых числа, задающих второй момент времени.
#     Выведите число секунд между этими моментами времени.

h1, m1, s1 = int(input()), int(input()), int(input())
h2, m2, s2 = int(input()), int(input()), int(input())
print((h2 * 3600 + m2 * 60 + s2) - (h1 * 3600 + m1 * 60 + s1))

# 12. Петя учится в школе и очень любит математику. Уже несколько занятий они с классом проходят арифметические выражения. 
#     На последнем уроке учительница написала на доске три положительных целых числа a, b, c. Задание заключалось в том, чтобы расставить между этими числами знаки операций '+' и '*', а также, 
#     возможно, скобки. Значение получившегося выражения должно быть как можно больше. 
#     Рассмотрим пример: пусть учительница выписала на доску числа 1, 2 и 3. Вот некоторые варианты расстановки знаков и скобок:
#     1+2*3=7
#     1*(2+3)=5
#     1*2*3=6
#     (1+2)*3=9
#     Обратите внимание на то, что знаки операций можно вставлять только между a и b, а также между b и c, то есть нельзя менять числа местами. 
#     Так, в приведенном примере нельзя получить выражение (1+3)*2.
#     Легко убедиться, что максимальное значение, которое можно получить, — это 9.
#     Ваша задача — по заданным a, b и c вывести, какое максимальное значение выражения можно получить.
#     Во входных данных записаны три целых числа a, b и c, каждое в отдельной строке (1 ≤ a, b, c ≤ 10).
#     Выведите максимальное значение выражения, которое можно получить.

a, b, c = int(input()), int(input()), int(input())
print(max(a + b * c, a * (b + c), a * b * c, (a + b) + c, (a + b) * c, a * b + c))