# 100. Напишите регулярное выражение, которое найдёт всё содержимое тегов p.
#      Нужно найти теги, подходящие по следующим условиям:
#      В начале тега стоит:
#      <p
#      Тут может быть последовательность символов минимально возможной длины
#      >
#      Внутри тега последовательность из любых символов минимально возможной длины
#      В конце тега стоит </p>
#      На вход программе подаётся 1 строка с html-разметкой.
#      Выведите в консоль содержимое тегов p. Каждое совпадение на новой строке.

import re

pattern = r'<p.*?>(.*?)</p>'
match = re.findall(pattern, input())
print(*match, sep='\n')