# 173. Напишите программу, которая с помощью модуля random моделирует броски монеты. Программа принимает на вход количество попыток и выводит результаты бросков: Орел или Решка (каждое на отдельной строке).
# 
#      Примечание. Например, при n=7 ваша программа может выводить:
#      Орел
#      Решка
#      Решка
#      Орел
#      Орел
#      Орел
#      Решка

for _ in range(int(input())):
    print(__import__('random').choice(['Орел', 'Решка']))