# 173. Напишите программу, которая с помощью модуля random моделирует броски монеты. Программа принимает на вход количество попыток и выводит результаты бросков: Орел или Решка (каждое на отдельной строке).
# 
#      Примечание. Например, при n=7 ваша программа может выводить:
#      Орел
#      Решка
#      Решка
#      Орел
#      Орел
#      Орел
#      Решка

for _ in range(int(input())):
    print(__import__('random').choice(['Орел', 'Решка']))

# 174. Напишите программу, которая с помощью модуля random моделирует броски игрального кубика c 6 гранями. 
#      Программа принимает на вход количество попыток и выводит результаты бросков — выпавшее число, которое написано на грани кубика (каждое на отдельной строке).
# 
#      Примечание. Например, при n=7 ваша программа может выводить:
#      5
#      5
#      6
#      6
#      2
#      6
#      2

for _ in range(int(input())):
    print(__import__('random').randint(1, 6))

# 175. Напишите программу, которая с помощью модуля random генерирует случайный пароль. Программа принимает на вход длину пароля и выводит случайный пароль, 
#      содержащий только символы английского алфавита a..z, A..Z (в нижнем и верхнем регистре).
# 
#      Примечание 1. Символам A..Z английского языка соответствуют номера с 65 по 90 в таблице символов ASCII.
#      Примечание 2. Символам a..z английского языка соответствуют номера с 97 по 122 в таблице символов ASCII.
#      Примечание 3. Используйте функцию chr() для получения символа по его номеру в таблице символов ASCII.
#      Примечание 4. Например, при длине пароля, равной 15 символам, ваша программа может выводить: peJFAmhqfaAeKDu

from random import randint

length = int(input())
password = ''

while len(password) != length:
    c = chr(randint(65, 122))
    if c.isalpha():
        password += c

print(password)

# 176. Лотерейный билет содержит 7 чисел из диапазона от 1 до 49 (включительно). Напишите программу, которая с помощью модуля random генерирует 7 различных случайных чисел для лотерейного билета. 
#      Программа должна вывести числа в порядке возрастания на одной строке через один символ пробела.
# 
#      Примечание. Убедитесь, что сгенерированные числа не содержат дубликатов.

ticket = set()
while len(ticket) != 7:
    ticket.add(__import__('random').randint(1, 49))

print(*sorted(ticket), sep=' ')

# 177. IP адрес состоит из четырех чисел из диапазона от 0 до 255 (включительно) разделенных точкой.
#      Напишите функцию generate_ip(), которая с помощью модуля random  генерирует и возвращает случайный корректный IP адрес.
# 
#      Примечание 1. Пример правильного (неправильного) IP адреса:
#      192.168.5.250        # правильный
#      199.300.521.255      # неправильный
#      Примечание 2. Вызывать функцию generate_ip() не нужно, требуется только реализовать.

def generate_ip():
    return '.'.join([str(__import__('random').randint(0, 255)) for _ in range(4)])

# 178. Почтовый индекс в Латверии имеет вид: 
#      LetterLetterNumber_NumberLetterLetter
#      где Letter – заглавная буква английского алфавита, Number – число от 0 до 99 (включительно).
#      Напишите функцию generate_index(), которая с помощью модуля random генерирует и возвращает случайный корректный почтовый индекс Латверии.
# 
#      Примечание 1. Пример правильного (неправильного) индекса Латверии:
#      AB23_56VG          # правильный
#      V3F_231GT          # неправильный
#      Примечание 2. Обратите внимание на символ _ в почтовом индексе.
#      Примечание 3. Вызывать функцию generate_index() не нужно, требуется только реализовать.

from random import choice, randint
from string import ascii_uppercase


def generate_index():
    return f'{choice(ascii_uppercase)}{choice(ascii_uppercase)}{randint(0, 99)}_{randint(0, 99)}{choice(ascii_uppercase)}{choice(ascii_uppercase)}'