# Перепишите код ниже так, чтобы напротив результата вызова функции выводилось значение, хранящееся по ключу

def red():
    return 'Color is red'

def green():
    return 'Color is green'

def blue():
    return 'Color is blue'

colors = {}
colors[green] = '00FF00'
colors[blue] = '0000FF'
colors[red] = 'FF0000'

for i, j in colors.items():
    print(f'{i()} - {j}')

# Представь, что ты работаешь в компании, которая занимается разработкой программного обеспечения.
# Твой начальник дал тебе задание написать программу, которая будет вычислять факториал числа.
# Факториал числа - это произведение всех натуральных чисел от 1 до этого числа. Например, факториал числа 5 равен 1 * 2 * 3 * 4 * 5 = 120.
# Однако, есть одно условие: ты должен сохранить результат вычисления факториала в глобальной переменной, чтобы его можно было использовать в других частях программы.
# Это означает, что значение факториала будет доступно для использования в других функциях или блоках кода.
# Также, твой начальник хочет, чтобы программа была оптимизирована и не вычисляла факториал числа каждый раз заново.
# Вместо этого, программа должна проверять, вызывалась ли уже функция с таким параметром.
# Если функция уже вызывалась с таким параметром, то программа должна вернуть сохраненное значение, а не вычислять его заново.
# Также перед возвратом такого значения функция должна вывести на экран «Get from cache value factorial(n)»
# Таким образом, твоя задача - написать функцию factorial, которая будет вычислять факториал числа, сохранять результат в глобальной переменной и проверять,
# вызывалась ли уже функция с таким параметром.

fact = 1
cache = dict()


def factorial(n):
    if cache.get(n) is not None:
        print(f'Get from cache value factorial({n})')
        return cache.get(n)
    global fact
    res = 1
    for i in range(1, n + 1):
        res *= i
    cache[n] = res
    fact = res
    return res

# Одной из базовых банковских услуг является обмен валют.
# Напишите функцию convert, которая умеет конвертировать доллар в другую валюту и наоборот.
# Для конвертации используются текущие курсы валют, которые хранятся в глобальном словаре exchange_rates.
# Результат округлите до двух знаков после запятой при помощи функции round

exchange_rates = {
    "USD": 1.0,
    "EUR": 0.861775,
    "GBP": 0.726763,
    "INR": 75.054725,
    "AUD": 1.333679,
    "CAD": 1.237816,
    "SGD": 1.346851,
}


def convert(currency1: str, currency2: str, count: int):
    return round(exchange_rates[currency2] / exchange_rates[currency1] * count, 2)