# 1. На вход программе подаются два целых числа a и b. Напишите программу, которая выводит:
#    - сумму чисел a и b;
#    - разность чисел a и b;
#    - произведение чисел a и b;
#    - частное чисел a и b;
#    - целую часть от деления числа a на b;
#    - остаток от деления числа a на b;
#    - корень квадратный из суммы их 10-х степеней.
#    
#    Формат входных данных
#    На вход программе подаются два целых числа a и b(b не равно 0), каждое на отдельной строке.
#    Формат выходных данных
#    Программа должна вывести результаты математических операций в соответствии с условием задачи.

a, b = int(input()), int(input())
print(a + b)
print(a - b)
print(a * b)
print(a / b)
print(a // b)
print(a % b)
print((a ** 10 + b ** 10) ** 0.5)

# 2. Напишите программу для вычисления и оценки индекса массы тела (ИМТ) человека. ИМТ показывает весит человек больше или меньше нормы для своего роста.
#    ИМТ человека рассчитывают по формуле: ИМТ = масса (кг) / рост(м) * рост(м), где масса измеряется в килограммах, а рост — в метрах.
#    Масса человека считается оптимальной, если его ИМТ находится между 18.5 и 25. Если ИМТ меньше 18.5, то считается, что человек весит ниже нормы. 
#    Если значение ИМТ больше 25, то считается, что человек весит больше нормы.
#    Программа должна вывести "Оптимальная масса", если ИМТ находится между 18.5 и 25 (включительно). "Недостаточная масса", если ИМТ меньше 18.5 
#    и "Избыточная масса", если значение ИМТ больше 25.
# 
#    Формат входных данных
#    На вход программе подается два числа: масса и рост человека, каждое на отдельной строке. 
#    Все входные числа являются вещественными, используйте для них тип данных float.
#    Формат выходных данных
#    Программа должна вывести текст в соответствии с условием задачи.

weight, height = float(input()), float(input())
imt = weight / (height ** 2)
if 18.5 <= imt <= 25:
    print('Оптимальная масса')
elif imt < 18.5:
    print('Недостаточная масса')
else:
    print('Избыточная масса')

# 3. Дана строка текста. Напишите программу для подсчета стоимости строки, исходя из того, что один любой символ (в том числе пробел) стоит 60 копеек. 
#    Ответ дайте в рублях и копейках в соответствии с примерами.
#    Формат входных данных
#    На вход программе подается строка текста.
#    Формат выходных данных
#    Программа должна вывести стоимость строки.
    
s = input()
cost = len(s) * 60
rouble = cost // 100
penny = cost % 100
print(f'{rouble} р. {penny} коп.')

# 4. Дана строка, состоящая из слов, разделенных пробелами. Напишите программу, которая подсчитывает количество слов в этой строке.
#    Формат входных данных
#    На вход программе подается строка.
#    Формат выходных данных
#    Программа должна вывести количество слов в строке.
#    Примечание 1. Кроме слов в тексте могут присутствовать только пробелы (один или несколько).
#    Примечание 2. Решите задачу в одну строчку кода 😎.

print(len(input().split()))