# 69. В переменной match записан объект Match. Выведите на экран:
#     Его нулевую группу
#     Начало вхождения нулевой группы
#     Конец вхождения нулевой группы
#     Атрибут pos
#     Атрибут endpos
#     Атрибут re
#     Атрибут string

import re

match = re.match(input(), input())
print(match.group(0))
print(match.start(0))
print(match.end(0))
print(match.pos)
print(match.endpos)
print(match.re)
print(match.string)

# 70. Многие функции возвращают None в результате своей работы, если ничего не было найдено.
#     Попробуйте вывести нулевую группу в Match-объекте, если совпадение было найдено. Если его нет - ничего не выводите.

import re

match = re.match(input(), input())
if match:
    print(match[0])

# 71. Напишите программу, которая найдёт первый хештег в тексте и выведет его в консоль.
#     Нужно найти первый хештег в тексте:
#     Начинается с символа #
#     После # стоит последовательность из латинских букв нижнего регистра

import re

pattern = r'#[a-z]+'
string = input()
match = re.search(pattern, string)
print(match[0] if match else '')

# 72. У Илона Маска на компьютере хранится очень много важных данных. Для запуска ракеты на Марс нужен секретный код, который был утерян. 
#     Илон написал программу, которая открывает все файлы на компьютере по очереди и проходит по каждой его строке (4 строки за один проход). 
#     Допишите его программу так, чтобы она находила слово "Код" или "код". 
#     У Илона больше нет никаких секретных кодов на компьютере, поэтому он решил использовать re.search(), т.к. re.search() находит только первое вхождение в строке.
#     Илон не помнит из каких символов он составлен, а также его длину, но он точно помнит, что перед самим кодом было написано слово код или Код. 
#     Если помочь Илону и сказать на какой строке и в каком её месте есть слово код, то он сразу сможет его найти.
#     Если в этих строках кода нет - нужно вывести строку: код не найден.
#     Найти строку, в которой есть последовательности код или Код. Получить номер этой строки и номер начала вхождения последовательности.

import re

line_number = 1
found = False

for i in range(4):
    line = input()
    match = re.search(r"код|Код", line)
    if match:
        print(f"{line_number} {match.start()}")
        found = True
        break
    line_number += 1

if not found:
    print("код не найден")